[
    {
        "id": "granny-unblocked",
        "title": "Granny Unblocked",
        "category": "Logic",
        "subcategory": "Escape",
        "instructions": "\n                                                Granny is a heart-pounding horror game that plunges players into a nightmare scenario: trapped inside a dark and sinister house with Granny, a terrifyingly deranged old woman. Your mission is clear: escape Granny's clutches and make it out of the house\n                                                alive. As you navigate through the dimly lit corridors and shadowy rooms, you must remain silent and cautious, as Granny's keen senses will alert her to your presence. But beware: the house is riddled with\n                                                deadly traps and obstacles that can spell doom if triggered. To survive, you'll need to search for clues, solve puzzles, and uncover hidden secrets that will lead to your freedom. But time is of the essence,\n                                                as Granny's patrols grow more frequent and her grip on reality becomes increasingly tenuous. With its immersive atmosphere, chilling sound design, and relentless tension, Granny offers a truly nerve-wracking\n                                                gaming experience. Each encounter with Granny is a heart-stopping test of nerves, as you struggle to outwit and outrun her in a desperate bid for survival.\n                                            ",
        "path": "scraping/GNHUST/games_data/granny-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/granny.png",
        "data_players": "7k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "1v1.lol-unblocked",
        "title": "1v1.LOL Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                1v1.LOL is an online multiplayer shooting and building game inspired by the mechanics of Fortnite. Players engage in one-on-one battles, building structures and fighting against each other in a fast-paced, competitive environment. It allows players to\n                                                practice their shooting and building skills. The primary objective is to eliminate the opponent through shooting, building, and tactical gameplay.\n                                            ",
        "path": "scraping/GNHUST/games_data/1v1.lol-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/1v1lol.avif",
        "data_players": "80k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "monkey-mart-unblocked",
        "title": "Monkey Mart Unblocked",
        "category": "Strategy",
        "subcategory": "Simulator",
        "instructions": "\n                                                Monkey Mart is a delightful and addictive simulation game that puts players in charge of managing their very own grocery store, but with a twist – the employees and customers are all adorable monkeys! Developed by indie game studio BananaByte, Monkey\n                                                Mart offers a whimsical and entertaining experience that combines business management with cute, cartoonish characters. In Monkey Mart, players step into the shoes of a new store manager tasked with running\n                                                a bustling grocery store filled with lively monkey customers. As the manager, it's your job to keep the shelves stocked, manage inventory, satisfy customer demands, and ensure that the store runs smoothly.\n                                                The game's mechanics are easy to grasp, with players using simple drag-and-drop controls to manage various aspects of the store. From restocking shelves and ringing up purchases to hiring and training new\n                                                employees, every decision you make will impact the success of your monkey mart.\n                                            ",
        "path": "scraping/GNHUST/games_data/monkey-mart-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/monkeymart.webp",
        "data_players": "21k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "bitlife-unblocked",
        "title": "BitLife Unblocked",
        "category": "Strategy",
        "subcategory": "Simulator",
        "instructions": "\n\n                                                BitLife is a captivating life simulation game that offers players the opportunity to live out a virtual existence from birth to death, experiencing all the highs and lows that come with it. Developed by Candywriter, BitLife has gained immense popularity\n                                                for its addictive gameplay, vast array of choices, and humorous yet realistic portrayal of life's unpredictable journey. In BitLife, players start by creating a character and guiding them through various\n                                                stages of life, from infancy to old age. Along the way, they'll make critical decisions that shape their character's personality, relationships, career, and overall destiny. Whether it's choosing their education,\n                                                pursuing a career path, starting a family, or engaging in recreational activities, every decision has consequences that can impact their character's life trajectory.\n                                            ",
        "path": "scraping/GNHUST/games_data/bitlife-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/bitlife.png",
        "data_players": "1k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    
    {
        "id": "slope-3-unblocked",
        "title": "Slope 3 Unblocked",
        "category": "Skill",
        "subcategory": "Endless Runner",
        "instructions": "\n                                                Slope 3 is an exhilarating and fast-paced arcade game that challenges players to navigate a ball down a treacherous slope filled with obstacles while avoiding pitfalls and hazards. Developed by RobKayS and released on platforms like CrazyGames, Slope\n                                                3 offers a thrilling and addictive gameplay experience. In Slope 3, players control a ball rolling down a continuously descending slope, which becomes increasingly steep and challenging as the game progresses.\n                                                The objective is simple: survive as long as possible while collecting gems and avoiding obstacles such as barriers, gaps, and rotating platforms.\n                                            ",
        "path": "scraping/GNHUST/games_data/slope-3-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/slope-3.png",
        "data_players": "39k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "among-us-online-unblocked",
        "title": "Among Us Online Unblocked",
        "category": "Logic",
        "subcategory": "Escape",
        "instructions": "\n                                                Among Us is a wildly popular multiplayer social deduction game where players work together—or against each other—on a spaceship, sky base, or planetary station. Players take on one of two roles: Crewmates or Impostors. As a Crewmate, your goal is to complete\n                                                tasks and identify the Impostors before they eliminate the team. As an Impostor, your mission is to sabotage the Crewmates' efforts and eliminate them without being discovered. The game is packed with suspense,\n                                                teamwork, and deception, making every match a unique experience.\n                                            ",
        "path": "scraping/GNHUST/games_data/among-us-online-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/amongusonline.png",
        "data_players": "94k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "subway-surfers-unblocked",
        "title": "Subway Surfers Unblocked",
        "category": "Skill",
        "subcategory": "Endless Runner",
        "instructions": "\n                                                Subway Surfers is an exhilarating endless runner game that takes you on a high-speed adventure through the bustling subway tracks of various cities around the world. In this fast-paced game, players take on the role of a daring young graffiti artist who's\n                                                being chased by a grumpy security guard and his faithful dog. As you dash through the vibrant and colorful subway environments, you'll need to jump over obstacles, dodge oncoming trains, and maneuver through\n                                                the bustling crowds. Along the way, collect coins, power-ups, and other rewards to boost your score and unlock exciting new characters, hoverboards, and outfits.\n                                            ",
        "path": "scraping/GNHUST/games_data/subway-surfers-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/subwaysufers.png",
        "data_players": "90k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "infinite-craft-unblocked",
        "title": "Infinite Craft Unblocked",
        "category": "Logic",
        "subcategory": "Building",
        "instructions": "\n                                                Infinite Craft is an immersive sandbox game that lets you explore, build, and survive in a vast, procedurally generated world. In this open-world adventure, you can mine resources, craft tools, and create structures while facing various challenges and\n                                                discovering hidden treasures. The game offers an expansive environment filled with diverse biomes, from dense forests to vast deserts, giving players endless opportunities to gather materials and build unique\n                                                creations.\n                                            ",
        "path": "scraping/GNHUST/games_data/infinite-craft-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/infinitecraft.png",
        "data_players": "6k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "iron-snout-unblocked",
        "title": "Iron Snout Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Iron Snout is an action-packed fighting game where you control a fearless pig battling hordes of wolves. With fast-paced gameplay and intuitive controls, you’ll unleash punches, kicks, and special moves to fend off attackers coming from all sides. Use\n                                                your martial arts skills to deflect weapons, counter enemy moves, and chain combos for higher scores. The game features endless waves of enemies, quirky humor, and vibrant visuals, offering a fun challenge\n                                                for players of all skill levels. Test your reflexes and see how long you can survive in this pig vs. wolf showdown!\n                                            ",
        "path": "scraping/GNHUST/games_data/iron-snout-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/ironsnout.jpeg",
        "data_players": "13k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "paper.io-2-unblocked",
        "title": "Paper.io 2 Unblocked",
        "category": "Logic",
        "subcategory": "Building",
        "instructions": "\n                                                Paper.io 2 is an engaging and addictive multiplayer game that challenges players to conquer territory and dominate the arena. In this colorful world, you control a small square character made of paper, and your objective is to expand your territory by\n                                                claiming empty space. As you move your character across the screen, you leave behind a trail of paper. By enclosing areas with your trail, you can capture them and add them to your territory. However, beware\n                                                of other players who are attempting to do the same. If they cross your trail before you complete the enclosure, you'll be eliminated. The game offers various strategies to outmaneuver opponents and claim\n                                                more territory. You can play defensively, carefully expanding your territory while avoiding confrontation, or take a more aggressive approach, actively seeking to eliminate other players and steal their\n                                                territory.\n                                            ",
        "path": "scraping/GNHUST/games_data/paper.io-2-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/paperio.jpg",
        "data_players": "47k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "melon-playground-unblocked",
        "title": "Melon Playground Unblocked",
        "category": "Logic",
        "subcategory": "Physics Puzzle",
        "instructions": "\n                                                Melon Playground is a quirky and engaging sandbox game that offers endless creative possibilities. In this open-world environment, you can manipulate physics, experiment with various tools, and create chaotic or amusing scenarios. Whether you're designing\n                                                intricate contraptions, testing the limits of different objects, or simply having fun with the interactive world, Melon Playground lets you explore without limits. The game’s simple mechanics, combined with\n                                                its playful graphics, make it a relaxing yet entertaining experience, perfect for players who enjoy experimenting and creating in a freeform space.\n                                            ",
        "path": "scraping/GNHUST/games_data/melon-playground-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/melonplayground.webp",
        "data_players": "2k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "once-upon-a-coma-unblocked",
        "title": "Once Upon A Coma Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                Once Upon A Coma is a spellbinding indie adventure game that weaves a poignant tale of loss, mystery, and self-discovery. You play as Pete, a young boy who awakens from a coma to find his world eerily changed and his sister missing. With only fragments\n                                                of his childhood memories, Pete embarks on a journey through a surreal and hauntingly beautiful landscape to uncover the truth. With its hand-drawn visuals, evocative soundtrack, and deeply emotional narrative,\n                                                Once Upon A Coma creates a world that feels both dreamlike and unsettling. As Pete delves deeper into the mysteries surrounding his coma and the strange events in his town, he must face the shadows of his\n                                                past and the truth about what happened while he slept.\n                                            ",
        "path": "scraping/GNHUST/games_data/once-upon-a-coma-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/onceuponacoma.avif",
        "data_players": "6k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "slopey-unblocked",
        "title": "Slopey Unblocked",
        "category": "Skill",
        "subcategory": "Endless Runner",
        "instructions": "\n                                                Experience the excitement of Slopey, an exhilarating endless runner that puts your reflexes to the test! In this fast-paced game, you'll guide a rolling ball down a series of steep slopes filled with obstacles and challenges. Your goal is to navigate\n                                                the ever-changing terrain while collecting points and power-ups to boost your score. With vibrant graphics and smooth controls, Slopey offers an addictive gameplay experience that keeps you coming back for\n                                                more. As you progress, the slopes become increasingly challenging, demanding quick thinking and precise timing. Compete against your friends and aim for the highest score on the leaderboard! Get ready to\n                                                roll and conquer the slopes in Slopey—how far can you go?\n\n\n                                            ",
        "path": "scraping/GNHUST/games_data/slopey-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/slopey.avif",
        "data_players": "54k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "angry-birds-unblocked",
        "title": "Angry Birds Unblocked",
        "category": "Logic",
        "subcategory": "Physics Puzzle",
        "instructions": "\n                                                Angry Birds is a fun and addictive puzzle game where players help the Angry Birds retrieve their stolen eggs from mischievous green pigs. Using a slingshot, players launch different types of birds, each with unique abilities, to destroy pig fortresses\n                                                made of wood, glass, and stone. With hundreds of levels, power-ups, and creative challenges, Angry Birds offers endless hours of strategic gameplay. The game’s charming characters, vibrant graphics, and\n                                                physics-based puzzles make it a must-play for fans of casual games. Test your skills, outsmart the pigs, and take back the eggs!\n                                            ",
        "path": "scraping/GNHUST/games_data/angry-birds-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/angrybirds.png",
        "data_players": "2k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "super-fowlst-unblocked",
        "title": "Super Fowlst Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                Super Fowlst is a fast-paced, action-packed arcade game where you take control of a fearless bird on a mission to stop a demonic invasion. The game features simple yet addictive gameplay, combining quick reflexes, strategic jumps, and intense battles.\n                                                As the heroic fowl, you'll navigate through a series of chaotic levels filled with demon enemies, traps, and obstacles. Your goal is to defeat waves of demons using your character's unique abilities, including\n                                                powerful attacks and special moves. The game’s levels are designed to challenge your skills, with new enemies and power-ups appearing as you progress.\n                                            ",
        "path": "scraping/GNHUST/games_data/super-fowlst-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/superfowlst.avif",
        "data_players": "4k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "two-neon-boxes-unblocked",
        "title": "Two Neon Boxes Unblocked",
        "category": "Logic",
        "subcategory": "Platforming Puzzle",
        "instructions": "\n                                                Step into the colorful world of Two Neon Boxes, where quick thinking and precision are key! In this unique puzzle-platformer, you’ll control two neon boxes at once, guiding them through a series of increasingly challenging levels filled with obstacles\n                                                and traps. Each box moves independently, requiring you to strategize and coordinate your movements carefully to avoid hazards and reach the goal. With its vibrant visuals and engaging gameplay, Two Neon\n                                                Boxes offers a thrilling challenge for players of all skill levels. Test your reflexes, solve clever puzzles, and enjoy the addictive gameplay that will keep you coming back for more. Are you ready to master\n                                                the dual challenge and guide the neon boxes to victory?\n\n\n                                            ",
        "path": "scraping/GNHUST/games_data/two-neon-boxes-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/twoneonboxes.png",
        "data_players": "2k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "tomb-of-the-mask-unblocked",
        "title": "Tomb of the Mask Unblocked",
        "category": "Logic",
        "subcategory": "Platforming Puzzle",
        "instructions": "\n                                                Dive into the thrilling world of Tomb of the Mask, an action-packed adventure that challenges your reflexes and strategic thinking! Set in a mysterious tomb filled with endless, procedurally generated mazes, you’ll navigate through intricate traps and\n                                                face off against cunning enemies as you seek treasure and glory. With intuitive controls and fast-paced gameplay, Tomb of the Mask keeps you on your toes as you race against time. Collect power-ups, unlock\n                                                unique abilities, and discover hidden secrets to help you survive the treacherous challenges ahead. Whether you’re a casual gamer or a seasoned pro, the dynamic levels and vibrant pixel art make for an engaging\n                                                experience that will keep you coming back for more. Are you ready to conquer the tomb and unveil its mysteries? Join the adventure in Tomb of the Mask today!\n\n\n                                            ",
        "path": "scraping/GNHUST/games_data/tomb-of-the-mask-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/tombofthemask.webp",
        "data_players": "4k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "eggy-car-unblocked",
        "title": "Eggy Car Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Eggy Car is a casual game in which you drive a car containing a loosely held egg, through hilly roads. If the egg falls out of your car, it breaks and the game is over. I AM SO SORRY FOR YOU! Collect strength to help you go further. Wishing you and the\n                                                soldier holding the egg. Good luck!\n                                            ",
        "path": "scraping/GNHUST/games_data/eggy-car-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/eggycar.avif",
        "data_players": "8k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "blockpost-unblocked",
        "title": "Blockpost Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                Blockpost is an exhilarating first-person shooter game that immerses players in fast-paced multiplayer battles set in a blocky, voxel-based world. With its simple yet captivating graphics and dynamic gameplay, Blockpost offers an adrenaline-pumping experience\n                                                for shooter enthusiasts of all skill levels. In Blockpost, players can customize their weapons and gear, choosing from a variety of firearms, explosives, and equipment to suit their playstyle. Whether you\n                                                prefer to charge into battle with an assault rifle, snipe enemies from a distance with a precision sniper rifle, or wreak havoc with explosives, there's a weapon for every strategy. Team up with friends\n                                                or compete against players from around the world in a variety of game modes, including team deathmatch, capture the flag, and more. Coordinate with your teammates, strategize your approach, and aim for victory\n                                                as you navigate through diverse maps filled with obstacles, cover, and strategic vantage points.\n                                            ",
        "path": "scraping/GNHUST/games_data/blockpost-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/blockpost.webp",
        "data_players": "18k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "dta-9-unblocked",
        "title": "DTA 9 Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n\n                                                DTA 9 is the latest installment in the acclaimed action-adventure series, following the success of DTA 6 on GNHUSTGames, bringing a fresh wave of excitement and innovation to gamers. Step into an expansive open-world environment teeming with life and\n                                                adventure. With stunning graphics and a captivating storyline, DTA 9 offers intense missions, complex characters, and an array of vehicles to explore and master. The game introduces new features, including\n                                                advanced AI, dynamic weather systems, and an enriched multiplayer mode that promises endless hours of competitive and cooperative play. Whether you're a seasoned fan or new to the series, DTA 9 delivers\n                                                an unparalleled gaming experience.\n                                            ",
        "path": "scraping/GNHUST/games_data/dta-9-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/dta9.webp",
        "data_players": "3k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "dta-6-unblocked",
        "title": "DTA 6 Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                Grand Theft Auto became a hit because it let people run around a world similar to the real world and do whatever chaotic thing they wanted, so we have games like DTA 6. This world is not like ours and probably came directly from the internet. The people\n                                                are geometric ragdolls that speak in memes and you're the only guy with full control over his limbs. How you decide to use that control is up to you, but the city is your playground and you have the means\n                                                to get a weapon arsenal to play with even more explosive results.\n                                            ",
        "path": "scraping/GNHUST/games_data/dta-6-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/dta6.png",
        "data_players": "57k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "tall.io-unblocked",
        "title": "Tall.io Unblocked",
        "category": "Logic",
        "subcategory": "Other",
        "instructions": "\n                                                Tall.io is a thrilling and addictive game where you fight to be the tallest stickman in the arena! Collect bricks of your color to grow taller while dodging obstacles and other stickmen that are taller than you. Run through gates and smash trees to gain\n                                                more height. Progress by conquering each arena!\n                                            ",
        "path": "scraping/GNHUST/games_data/tall.io-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/tallio.avif",
        "data_players": "1k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "shortcut-race-unblocked",
        "title": "Shortcut Race Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Shortcut Race is a high-speed, action-packed racing game where taking shortcuts is the key to victory! Collect bricks along the track to build bridges and cut ahead of your opponents, dodging obstacles and racing against the clock. Use your strategy and\n                                                timing to navigate each course, outsmarting rivals as you climb the leaderboard. With exciting levels, challenging twists, and intense competition, Shortcut Race lets you experience the thrill of the race\n                                                like never before. Can you take the right shortcuts and cross the finish line first? Join the race and find out!\n                                            ",
        "path": "scraping/GNHUST/games_data/shortcut-race-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/shortcutrace.png",
        "data_players": "15k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "pixel-shooter-unblocked",
        "title": "Pixel Shooter Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                Pixel Shooter is an action-packed retro arcade game that puts your shooting skills to the test. Blast through endless waves of enemies with an array of powerful weapons and unlock exciting upgrades to enhance your gameplay. The vibrant pixel art style,\n                                                combined with fast-paced levels and dynamic combat, creates a thrilling experience for gamers of all skill levels. With challenging missions and an ever-growing difficulty curve, Pixel Shooter will keep\n                                                you on the edge of your seat as you strive to top the leaderboards. Do you have what it takes to become the ultimate pixel shooter?\n                                            ",
        "path": "scraping/GNHUST/games_data/pixel-shooter-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/pixelshooter.png",
        "data_players": "0k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "save-my-pet-unblocked",
        "title": "Save My Pet Unblocked",
        "category": "Logic",
        "subcategory": "Platforming Puzzle",
        "instructions": "\n                                                Save My Pet is a heartwarming and action-packed adventure game where players step into the shoes of a heroic rescuer on a mission to save adorable animals in distress. Your journey begins as you encounter lost pets in need of help, and it’s up to you\n                                                to solve puzzles, navigate challenging environments, and overcome various obstacles to reunite them with their loving owners. Explore a variety of vibrant and beautifully designed levels, each filled with\n                                                unique challenges that require creativity and quick thinking. Use your problem-solving skills to unlock new areas, gather helpful items, and complete fun mini-games that enhance the rescue experience.\n                                            ",
        "path": "scraping/GNHUST/games_data/save-my-pet-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/savemypet.png",
        "data_players": "15k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "doge-miner-2-unblocked",
        "title": "Doge Miner 2 Unblocked",
        "category": "Strategy",
        "subcategory": "Idle",
        "instructions": "\n\n                                                In Doge Miner 2, dive into the addictive world of cryptocurrency mining with everyone's favorite internet sensation, Doge! Click your way through an interstellar adventure as you collect Dogecoin, upgrade your mining rig, and journey to distant planets.\n                                                Unleash the power of your clicks to amass wealth, unlock new upgrades, and explore the vast reaches of space. With charming graphics and simple gameplay, Doge Miner 2 offers endless hours of fun for players\n                                                of all ages. Join the Doge community and start mining your way to riches today!\n                                            ",
        "path": "scraping/GNHUST/games_data/doge-miner-2-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/dogeminer.jpg",
        "data_players": "0k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "drive-mad-unblocked",
        "title": "Drive Mad Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Drive Mad is an adrenaline-pumping racing game that will get your heart racing and your adrenaline pumping. Step into the driver’s seat of powerful sports cars and compete in high-speed races across a variety of challenging tracks. With stunning graphics,\n                                                realistic physics, and intense gameplay, Drive Mad delivers an immersive racing experience that will keep you on the edge of your seat. Can you handle the speed and outmaneuver your opponents to become the\n                                                ultimate racing champion?\n                                            ",
        "path": "scraping/GNHUST/games_data/drive-mad-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/drivemad.webp",
        "data_players": "8k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "fornite-unblocked",
        "title": "Fornite Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                Fortnite is a massively popular online multiplayer battle royale game developed by Epic Games. It's renowned for its unique blend of action-packed gameplay, building mechanics, and vibrant graphics. The main objective of Fortnite is to be the last player\n                                                or team standing among a group of up to 100 players on a constantly shrinking map.\n                                            ",
        "path": "scraping/GNHUST/games_data/fornite-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/fortnite.png",
        "data_players": "13k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "stickman-dragon-fight-unblocked",
        "title": "Stickman Dragon Fight Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Dive into the exhilarating world of Stickman Dragon Fight, where intense action and epic battles await! Take control of your stickman warrior and unleash powerful attacks, mastering unique abilities to defeat fierce opponents. With stunning graphics and\n                                                smooth animations, each fight is a thrilling spectacle. Customize your fighter, level up your skills, and challenge other players in dynamic combat arenas. Whether you're a casual gamer or a martial arts\n                                                enthusiast, Stickman Dragon Fight offers an addictive gameplay experience that keeps you coming back for more. Join the fight and become a legend today!\n                                            ",
        "path": "scraping/GNHUST/games_data/stickman-dragon-fight-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/stickmandragonfight.avif",
        "data_players": "8k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "stick-defenders-unblocked",
        "title": "Stick Defenders Unblocked",
        "category": "Strategy",
        "subcategory": "Tower Defense",
        "instructions": "\n                                                Stick Defenders is a captivating strategy game that takes players on an epic journey through time, challenging them to build and defend their civilization against relentless enemies. Developed by Max Games Studios, this thrilling game combines elements\n                                                of strategy, defense, and warfare into an addictive gameplay experience. In Stick Defenders, players start in the Stone Age with primitive weaponry and technology. Their goal is to evolve their civilization\n                                                through various historical eras, from the dawn of humanity to the far reaches of futuristic warfare. As players progress, they must manage resources, research new technologies, and train armies to fend off\n                                                attacks from rival civilizations.\n                                            ",
        "path": "scraping/GNHUST/games_data/stick-defenders-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/stickdefenders.webp",
        "data_players": "6k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "stickman-gun-fight-unblocked",
        "title": "Stickman Gun Fight Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                Stickman Gun Fight is an action-packed shooter where you control a stickman armed to the teeth with powerful weapons. Engage in epic battles, take down enemies, and navigate challenging levels filled with intense gunfights. With simple yet addictive gameplay,\n                                                you can choose from a variety of weapons, unlock new gear, and customize your stickman for battle. Whether you’re taking on waves of enemies or going head-to-head with fierce bosses, Stickman Gun Fight will\n                                                keep you on the edge of your seat. Ready to join the fight and prove your shooting skills?\n                                            ",
        "path": "scraping/GNHUST/games_data/stickman-gun-fight-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/stickmangunfight.webp",
        "data_players": "15k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "burrito-bison-unblocked",
        "title": "Burrito Bison Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n\n                                                Burrito Bison is an action-packed, physics-based launcher game where you play as a luchador battling to reclaim your stolen cookbook. Launch yourself into the sky, bounce off gummy bears, and smash through obstacles to gain speed and distance. Unlock\n                                                powerful upgrades, discover unique abilities, and take down bosses as you journey through vibrant and chaotic worlds. With its addictive gameplay, colorful visuals, and humor-filled storyline, Burrito Bison\n                                                offers endless fun and challenges for players of all ages. Get ready to launch, smash, and soar to victory!\n                                            ",
        "path": "scraping/GNHUST/games_data/burrito-bison-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/burritobison.png",
        "data_players": "6k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "retro-bowl-unblocked",
        "title": "Retro Bowl Unblocked",
        "category": "Classic",
        "subcategory": "Other",
        "instructions": "\n                                                Retro Bowl brings a nostalgic feel with its pixel art graphics, reminiscent of games from the '80s and '90s. Despite its simple appearance, the game offers an engaging experience, allowing players to manage a football team and play matches. Players start\n                                                by managing a team with limited abilities and aim to lead them to victory. The game features various aspects, such as recruiting players, managing finances, upgrading facilities, and playing games to progress\n                                                through seasons.\n                                            ",
        "path": "scraping/GNHUST/games_data/retro-bowl-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/retrobowl.avif",
        "data_players": "3k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "pizza-tower-unblocked",
        "title": "Pizza Tower Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Pizza Tower is a delightfully quirky and fast-paced indie game that serves up a unique blend of platforming, action, and absurd humor. Developed by GigaB00ts, this retro-inspired adventure transports players into a whimsical world filled with pizza-themed\n                                                chaos and challenges. In Pizza Tower, players assume the role of a charmingly eccentric chef named Peppino who finds himself trapped in a mysterious tower filled with bizarre creatures, wacky obstacles,\n                                                and, of course, plenty of pizza. With his trusty rolling pin in hand, Peppino must navigate through a series of increasingly challenging levels, each brimming with inventive puzzles and zany enemies.\n                                            ",
        "path": "scraping/GNHUST/games_data/pizza-tower-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/pizzatower.webp",
        "data_players": "8k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "bloxorz-unblocked",
        "title": "Bloxorz Unblocked",
        "category": "Logic",
        "subcategory": "Platforming Puzzle",
        "instructions": "\n                                                Bloxorz is a captivating puzzle game that will put your spatial reasoning and problem-solving skills to the test. Maneuver a rectangular block through a series of challenging levels, each filled with obstacles and traps. The goal is simple: navigate the\n                                                block to its designated destination by flipping and rolling it across the grid. However, with each level presenting increasingly complex layouts and obstacles, finding the correct path becomes a true test\n                                                of wit and strategy. With minimalist graphics and intuitive controls, Bloxorz offers a satisfyingly challenging experience that will keep you hooked for hours. Are you ready to tackle the twisting puzzles\n                                                and conquer Bloxorz? Play now and put your mind to the ultimate test!\n                                            ",
        "path": "scraping/GNHUST/games_data/bloxorz-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/bloxorz.jpg",
        "data_players": "3k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "make-it-meme-unblocked",
        "title": "Make It Meme Unblocked",
        "category": "Classic",
        "subcategory": "Trivia",
        "instructions": "\n                                                Make It Meme invites you to step into the world of internet humor and unleash your creativity like never before. Dive into a whirlwind of laughter as you craft your own memes, combining images and text to create viral sensations. From witty observations\n                                                to absurd situations, the possibilities are endless. Challenge your friends or compete against meme enthusiasts from around the globe to see who can create the funniest, most shareable memes. With intuitive\n                                                controls and a vast library of templates and stickers, anyone can become a meme master. Get ready to turn everyday moments into internet gold and join the meme-making revolution in Make It Meme!\n                                            ",
        "path": "scraping/GNHUST/games_data/make-it-meme-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/makeitmeme.avif",
        "data_players": "66k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "parkour-race-unblocked",
        "title": "Parkour Race Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                In Parkour Race, every street corner becomes a playground and every obstacle a challenge waiting to be conquered. With lightning-fast reflexes and nimble moves, players navigate through urban landscapes, leaping across rooftops, sliding under barriers,\n                                                and performing gravity-defying stunts. Whether competing against friends or tackling solo missions, the game offers a thrilling blend of speed, strategy, and precision. With each level presenting new hurdles\n                                                and opportunities for creative movement, players must master the art of parkour to emerge victorious. So, gear up, embrace the thrill of the chase, and race your way to parkour glory in this adrenaline-fueled\n                                                adventure!\n                                            ",
        "path": "scraping/GNHUST/games_data/parkour-race-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/parkourrace.avif",
        "data_players": "15k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "level-devil-unblocked",
        "title": "Level Devil Unblocked",
        "category": "Logic",
        "subcategory": "Platforming Puzzle",
        "instructions": "\n                                                Level Devil invites players into a world of mind-bending puzzles and addictive challenges. Dive into a labyrinth of increasingly complex levels, each designed to test your cognitive skills and reflexes to the limit. With intuitive controls and a captivating\n                                                gameplay experience, navigate through obstacles, traps, and enigmatic mazes as you strive to conquer every stage. Whether you're a puzzle enthusiast or an avid gamer seeking a thrilling challenge, Level\n                                                Devil offers hours of entertainment and brain-teasing fun. Are you ready to unleash your inner devil and conquer the levels that await? Join the adventure now!\n                                            ",
        "path": "scraping/GNHUST/games_data/level-devil-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/leveldevil.avif",
        "data_players": "4k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "ping-pong-go-unblocked",
        "title": "Ping Pong Go Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Ping Pong Go is the ultimate online table tennis experience, offering a dynamic mix of classic and innovative gameplay modes. Whether you’re aiming for a high score in Classic mode, advancing through challenging levels in Arcade mode, or testing your\n                                                accuracy in Bug Hunt mode, there’s something for every ping pong enthusiast. Win matches, earn gems, and unlock a variety of paddles and rewards as you climb the ranks. With its fast-paced action and endless\n                                                challenges, Ping Pong Go! will keep you coming back for more. Ready to dominate the table and become a ping pong champion?\n                                            ",
        "path": "scraping/GNHUST/games_data/ping-pong-go-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/pingponggo.avif",
        "data_players": "20k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "justfall.lol-unblocked",
        "title": "JustFall.LOL Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                JustFall.LOL is an entertaining online multiplayer game that challenges players to survive a thrilling free-fall descent through a series of platforms. With its simple yet addictive gameplay, players must navigate their characters through a vertical maze\n                                                of obstacles, traps, and other players, all while trying to be the last one standing. As you plummet downwards, you'll encounter various power-ups and hazards that can either aid or hinder your progress.\n                                                With each level, the intensity increases, testing your reflexes and strategic thinking as you strive to outmaneuver your opponents and secure your place at the top.\n                                            ",
        "path": "scraping/GNHUST/games_data/justfall.lol-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/justfall.jpg",
        "data_players": "1k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "fall-boys-unblocked",
        "title": "Fall Boys Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Fall Boys: Ultimate Knockout is a whimsical battle royale game where players control jellybean-like characters and compete in various challenges and obstacle courses in a colorful, whimsical world. In each round, players must outlast opponents by avoiding\n                                                obstacles, completing tasks, and strategically navigating the environment to qualify for the next stage. The game's lighthearted nature, vibrant visuals, and chaotic gameplay have made it a hit among players\n                                                of all ages. With its blend of skill, luck, and whimsy, Fall Boys offers endless entertainment and laughter as players bounce, stumble, and tumble their way through each round in pursuit of victory.\n                                            ",
        "path": "scraping/GNHUST/games_data/fall-boys-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/fallboys.png",
        "data_players": "5k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "stumble-guys-unblocked",
        "title": "Stumble Guys Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Stumble Guys is a whimsical multiplayer party game that invites players into a colorful world of chaos and hilarity. In this fast-paced and unpredictable game, players compete against each other in a series of wacky obstacle courses and challenges. As\n                                                a Stumble Guy, your goal is to navigate through a variety of absurd and challenging obstacles, including spinning hammers, swinging pendulums, and slippery slides, all while avoiding pitfalls and traps.\n                                                The courses are filled with surprises and unpredictable elements, keeping players on their toes and ensuring that every round is a unique and exciting experience.\n                                            ",
        "path": "scraping/GNHUST/games_data/stumble-guys-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/stumbleguys.jpg",
        "data_players": "92k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "zombie-rush-unblocked",
        "title": "Zombie Rush Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                Step into the chaos of Zombie Rush, where the world is teeming with bloodthirsty zombies, and survival is your only mission. Armed with a range of deadly weapons, you'll face relentless waves of zombies, each with their own strengths and weaknesses. Upgrade\n                                                your gear, unlock new abilities, and strategize your way through increasingly challenging levels. With fast-paced action, immersive gameplay, and a variety of zombie types to conquer, Zombie Rush delivers\n                                                a heart-pounding experience that will keep you on the edge of your seat. Can you outlast the undead and become the ultimate survivor?\n                                            ",
        "path": "scraping/GNHUST/games_data/zombie-rush-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/zombierush.avif",
        "data_players": "1k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "zombie-siege-outbreak-unblocked",
        "title": "Zombie Siege Outbreak Unblocked",
        "category": "Strategy",
        "subcategory": "Tower Defense",
        "instructions": "\n                                                Zombie Siege Outbreak throws you into the heart of a zombie apocalypse where your strategic skills are crucial for survival. As the commander of a last-ditch defense, you must build and fortify your base to withstand waves of relentless undead. Deploy\n                                                a variety of defenses, upgrade your weapons, and manage resources wisely to fend off the zombie horde. With intense action, strategic gameplay, and a gripping storyline, Zombie Siege Outbreak challenges\n                                                you to protect humanity and survive the outbreak. Will you rise to the challenge and prevent the world from falling into chaos?\n\n\n                                            ",
        "path": "scraping/GNHUST/games_data/zombie-siege-outbreak-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/zombiesiegeoutbreak.jfif",
        "data_players": "37k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "bomber-royale-unblocked",
        "title": "Bomber Royale Unblocked",
        "category": "Classic",
        "subcategory": "Retro",
        "instructions": "\n\n                                                Bomber Royale is an action-packed online 3D battle royale game created by NadGames. It offers both single-player and multiplayer modes, providing fantastic real-time action that will keep you on the edge of your seat. In Bomber Royale, you can throw bombs\n                                                and strategically push them towards your opponents, timing your explosions for maximum impact. Destroy crates and surrounding items to replenish your arsenal and collect bonus items. Use your in-game currency\n                                                to unlock new skins and customize your character. With its exciting gameplay and vibrant graphics, Bomber Royale is sure to blow you away! Give it a try—this game is da bomb!\n                                            ",
        "path": "scraping/GNHUST/games_data/bomber-royale-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/bomberroyale.jfif",
        "data_players": "4k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "fish-eat-fish-unblocked",
        "title": "Fish Eat Fish Unblocked",
        "category": "Logic",
        "subcategory": "Building",
        "instructions": "\n                                                Fish Eat Fish is an addictive and fast-paced game where you take control of a small fish in a vast ocean. Your goal is simple: eat smaller fish to grow bigger while avoiding larger predators that can turn you into their next meal. With vibrant underwater\n                                                graphics and increasingly challenging levels, you’ll need quick reflexes and smart strategies to survive and thrive. Customize your fish, unlock new abilities, and compete with friends to see who can dominate\n                                                the deep sea. Dive in and start your aquatic adventure now!\n                                            ",
        "path": "scraping/GNHUST/games_data/fish-eat-fish-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/fisheatfish.avif",
        "data_players": "38k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "shark.io-unblocked",
        "title": "Shark.io Unblocked",
        "category": "Logic",
        "subcategory": "Building",
        "instructions": "\n\n                                                Dive into the thrilling world of Shark.io, where you compete in a multiplayer battle arena as a formidable shark. Choose from a selection of cool horns and customize your shark with various skins, including transformations into other aquatic and unique\n                                                creatures. Navigate the waters strategically, using speed boosts to outmaneuver opponents and collect white objects to fill your boost bar. Accumulate stars to increase your score and ascend to the top as\n                                                the apex predator of the sea. Will you reign supreme in this epic aquatic showdown?\n                                            ",
        "path": "scraping/GNHUST/games_data/shark.io-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/sharkio.avif",
        "data_players": "4k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "evoworld.io-unblocked",
        "title": "EvoWorld.io Unblocked",
        "category": "Logic",
        "subcategory": "Building",
        "instructions": "\n                                                EvoWorld.io, formerly known as Fly or Die, is an engaging and addictive multiplayer survival game where you begin your journey as a tiny fly and evolve into a multitude of different creatures. Navigate through diverse environments, from lush forests to\n                                                arid deserts, as you eat to grow and climb the food chain. Watch out for predators and other players while you hunt for food and evolve into more powerful beings. With unique abilities for each creature\n                                                and a dynamic ecosystem, EvoWorld.io offers endless challenges and fun. Join the adventure now and see how far you can evolve in the thrilling world of EvoWorld.io!\n                                            ",
        "path": "scraping/GNHUST/games_data/evoworld.io-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/flyordie.jpg",
        "data_players": "1k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "fireboy-and-watergirl-3-ice-temple-unblocked",
        "title": "Fireboy and Watergirl 3: Ice Temple Unblocked",
        "category": "Logic",
        "subcategory": "Platforming Puzzle",
        "instructions": "\n                                                Fireboy and Watergirl 3: Ice Temple is an enchanting and challenging puzzle-platformer game that captivates players with its clever level design and cooperative gameplay mechanics. Developed by Oslo Albet and Jan Villanueva, this popular series invites\n                                                players to embark on an adventure as two elemental characters, Fireboy and Watergirl, each with unique abilities. In Fireboy and Watergirl, players must navigate through a series of intricately designed\n                                                levels filled with obstacles, traps, and puzzles. The game's core mechanic revolves around teamwork, as players control both characters simultaneously or with a friend, utilizing their respective elemental\n                                                powers to overcome obstacles and reach the exit door.",
        "path": "scraping/GNHUST/games_data/fireboy-and-watergirl-3-ice-temple-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/fireboywatergirl.avif",
        "data_players": "6k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "gladihoppers-unblocked",
        "title": "Gladihoppers Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Gladihoppers is an action-packed, physics-based fighting game that throws you into the wild and unpredictable world of gladiator battles. Play as a customizable warrior, choosing from a variety of weapons and armor, and enter the arena to face off against\n                                                fierce opponents. With dynamic, 2D gameplay and a unique mix of jumping and fighting moves, Gladihoppers challenges you to think quickly and fight smart. Conquer each opponent in single-player or multiplayer\n                                                modes, mastering different combat styles and earning your place as the ultimate gladiator. Get ready for hilarious, intense battles!\n                                            ",
        "path": "scraping/GNHUST/games_data/gladihoppers-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/gladihoppers.jfif",
        "data_players": "16k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "the-binding-of-isaac-unblocked",
        "title": "The Binding of Isaac Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                The Binding of Isaac is a roguelike action-adventure game developed by Edmund McMillen and Florian Himsl. The game's storyline is dark and revolves around the main character, Isaac, who is trying to escape his deeply religious mother's attempts to sacrifice\n                                                him to prove her faith to God. The gameplay involves exploring randomly generated dungeons, battling enemies, and collecting various power-ups and items to progress through the game.\n                                            ",
        "path": "scraping/GNHUST/games_data/the-binding-of-isaac-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/the-binding-of-isaac.jpg",
        "data_players": "87k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "jacksmith-unblocked",
        "title": "Jacksmith Unblocked",
        "category": "Strategy",
        "subcategory": "Simulator",
        "instructions": "\n                                                Jacksmith is a unique blend of crafting and strategy, where you play as a skilled blacksmith, Jack, tasked with forging weapons for various warriors. From swords and bows to axes and shields, you’ll craft custom weapons using different materials, aiming\n                                                to create the best gear for each battle. Once equipped, guide your warriors through tactical combat as they face off against enemies. Your success depends on the quality of the weapons you forge and how\n                                                well you strategize in battle. With engaging gameplay, charming visuals, and a mix of crafting and combat, Jacksmith offers an exciting experience for players who enjoy both creativity and action.\n                                            ",
        "path": "scraping/GNHUST/games_data/jacksmith-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/jacksmith.jfif",
        "data_players": "79k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "duo-vikings-unblocked",
        "title": "Duo Vikings Unblocked",
        "category": "Logic",
        "subcategory": "Escape",
        "instructions": "\n                                                Duo Vikings is an exhilarating cooperative adventure game developed by 7Spot Games. Step into the shoes of two fearless Vikings embarking on a daring castle raid filled with obstacles and treasures. Join forces with a friend to tackle intricate puzzles,\n                                                activate switches, open doors, and overcome breakable barriers as you navigate through beautifully crafted levels. With stunning visuals and strategic gameplay, Duo Vikings promises an immersive experience\n                                                where teamwork and cunning are key to claiming victory and earning your place among legends.\n                                            ",
        "path": "scraping/GNHUST/games_data/duo-vikings-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/duovikings.avif",
        "data_players": "15k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "diggy-unblocked",
        "title": "Diggy Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                Diggy is an exciting adventure game where you help Diggy drill through the earth in search of valuable treasures and hidden gems. Use your drill and radar to dig deeper, collect resources, and unlock upgrades that enhance your digging abilities. Navigate\n                                                through different terrains, avoid obstacles, and uncover secrets buried deep underground. With each dig, youll get closer to discovering the mysteries of the world below. How deep can you dig?\n                                            ",
        "path": "scraping/GNHUST/games_data/diggy-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/diggy.jfif",
        "data_players": "63k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "digging-master-unblocked",
        "title": "Digging Master Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                Digging Master is an addictive and immersive mining game where you step into the shoes of a master excavator. Dive into underground worlds filled with hidden gems, valuable resources, and ancient artifacts waiting to be discovered. Upgrade your tools\n                                                and equipment to dig deeper and uncover more treasures. With each level, face new challenges and obstacles that test your mining skills. Whether you're a casual player or a dedicated gamer, Digging Master\n                                                offers endless fun and excitement as you explore and conquer the subterranean realms. Start your excavation adventure today and become the ultimate Digging Master!\n                                            ",
        "path": "scraping/GNHUST/games_data/digging-master-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/diggingmaster.jpg",
        "data_players": "1k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "combat-online-unblocked",
        "title": "Combat Online Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                Experience the thrill of adrenaline-pumping warfare in Combat Online, the ultimate multiplayer shooter game! Engage in intense battles across diverse maps and game modes, showcasing your tactical prowess and sharpshooting skills. Customize your weapons\n                                                and gear to suit your playstyle as you compete against players from around the world. With fast-paced action and dynamic gameplay, Combat Online delivers an immersive gaming experience that will keep you\n                                                on the edge of your seat. Are you ready to join the fray and dominate the battlefield? Enter Combat Online now and prove your worth as a true warrior!\n                                            ",
        "path": "scraping/GNHUST/games_data/combat-online-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/combatonline.jpg",
        "data_players": "4k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "foggy-fox-unblocked",
        "title": "Foggy Fox Unblocked",
        "category": "Logic",
        "subcategory": "Platforming Puzzle",
        "instructions": "\n                                                Foggy Fox is an immersive puzzle adventure game that takes you on a journey through mysterious fog-covered landscapes. You play as a clever fox, navigating through misty forests, ancient ruins, and mystical environments filled with hidden secrets and\n                                                obstacles. Solve creative puzzles, uncover hidden paths, and unlock new areas as you piece together the story behind the fog. With its atmospheric visuals, captivating soundtrack, and engaging gameplay,\n                                                Foggy Fox invites you to explore a world where every step brings new discoveries. Will you be able to uncover the truth hidden within the fog?\n                                            ",
        "path": "scraping/GNHUST/games_data/foggy-fox-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/foggyfox.jfif",
        "data_players": "16k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "snow-rider-3d-unblocked",
        "title": "Snow Rider 3D Unblocked",
        "category": "Skill",
        "subcategory": "Endless Runner",
        "instructions": "\n                                                Snow Rider is a colorful car racing game in an open world where you must collect dozens of stars and some wrenches to repair your vehicle when you suffer a small accident. Do everything in your power to accumulate enough money to buy new and exciting\n                                                cars of the latest generation, get to your destination, drift, jump without fear, perform unique aerial stunts and land on all four wheels to reach victory without a single scratch. Good luck!\n                                            ",
        "path": "scraping/GNHUST/games_data/snow-rider-3d-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/snowrider.png",
        "data_players": "15k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "plants-vs.-zombies-unblocked",
        "title": "Plants vs. Zombies Unblocked",
        "category": "Strategy",
        "subcategory": "Tower Defense",
        "instructions": "\n                                                Plants vs. Zombies is a wildly popular tower defense strategy game where you take on the role of a homeowner defending your garden from a quirky horde of zombies. Armed with an array of unique plants, each with special abilities, you must strategically\n                                                place them across your lawn to fend off increasingly difficult waves of zombies. From sunflowers that generate sunlight to pea shooters that blast zombies, the game combines humor, creativity, and strategic\n                                                thinking.\n                                            ",
        "path": "scraping/GNHUST/games_data/plants-vs.-zombies-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/plantsvszombies.jpg",
        "data_players": "69k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "narrow-one-unblocked",
        "title": "Narrow One Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                Narrow One is an IO game that takes archery to a new level of accuracy and challenge. With stunning graphics and immersive gameplay, you'll find yourself drawn into a world where every shot counts. You and your teammates will fight through many different\n                                                maps, control the map, and win with the other team. Navigate through complex environments, aim in tight spaces, test your skill and accuracy like never before. Are you ready to take on the challenge? Enter\n                                                the world of Narrow One and prove your archery prowess today!\n                                            ",
        "path": "scraping/GNHUST/games_data/narrow-one-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/narrowone.avif",
        "data_players": "0k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "archer-master-3d-castle-defense-unblocked",
        "title": "Archer Master 3D: Castle Defense Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                Archer Master 3D: Castle Defense plunges you into a thrilling world of medieval warfare and strategic defense. As the kingdoms premier archer, your mission is to protect your castle from relentless waves of invaders. With precision aiming and swift reflexes,\n                                                youll need to fend off attackers, manage your resources, and upgrade your skills to withstand increasingly difficult challenges. The game features stunning 3D graphics, diverse enemy types, and immersive\n                                                tower defense mechanics. Sharpen your archery skills, fortify your castle, and rise to the challenge as the ultimate archer hero!\n\n\n                                            ",
        "path": "scraping/GNHUST/games_data/archer-master-3d-castle-defense-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/archermaster3d.jfif",
        "data_players": "4k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "solar-smash-unblocked",
        "title": "Solar Smash Unblocked",
        "category": "Classic",
        "subcategory": "Other",
        "instructions": "\n                                                Solar Smash is an explosive space simulation game where you control powerful weapons to destroy planets in a variety of ways. From lasers and missiles to asteroids and black holes, you can unleash devastating forces to cause complete chaos across the\n                                                cosmos. Explore different planets and experiment with different destruction methods in this action-packed game. With stunning visuals and endless destruction possibilities, Solar Smash offers an engaging\n                                                experience for players who love watching things go boom in space. How much destruction can you cause before the universe crumbles?\n                                            ",
        "path": "scraping/GNHUST/games_data/solar-smash-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/solarsmash.png",
        "data_players": "2k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "learn-to-fly-2-unblocked",
        "title": "Learn to Fly 2 Unblocked",
        "category": "Skill",
        "subcategory": "Endless Runner",
        "instructions": "\n                                                Learn to Fly 2 is a highly engaging and addictive online game that challenges players to help a determined penguin achieve its dream of flying. Developed by Light Bringer Games, this sequel to the popular \"Learn to Fly\" series offers an entertaining blend\n                                                of physics-based gameplay, humorous storyline, and addictive progression mechanics. In Learn to Fly 2, players once again assume the role of the resilient penguin who, undeterred by past failures, is determined\n                                                to prove that penguins can indeed fly. Set against the backdrop of a snowy landscape, players embark on an epic journey to launch their penguin into the sky using various contraptions and upgrades.\n                                            ",
        "path": "scraping/GNHUST/games_data/learn-to-fly-2-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/learntofly.avif",
        "data_players": "19k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "learn-to-fly-3-unblocked",
        "title": "Learn to Fly 3 Unblocked",
        "category": "Skill",
        "subcategory": "Endless Runner",
        "instructions": "\n                                                Learn to Fly 3 is an exciting and addictive physics-based game where you help a penguin achieve its dream of flight. In this third installment of the Learn to Fly series, you guide the penguin through various challenges, improving its flying abilities\n                                                by launching it from a ramp and upgrading its equipment with the money earned from successful flights.\n                                            ",
        "path": "scraping/GNHUST/games_data/learn-to-fly-3-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/learntofly3.webp",
        "data_players": "42k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "mr.-mine-unblocked",
        "title": "Mr. Mine Unblocked",
        "category": "Strategy",
        "subcategory": "Idle",
        "instructions": "\n\n                                                Mr. Mine is an engaging idle mining game that takes you on an exciting journey deep underground. As the overseer of a mining operation, your goal is to dig through layers of earth to uncover valuable resources and treasures. Upgrade your equipment, hire\n                                                and manage a team of miners, and expand your mining empire. With each level, discover rare gems, mysterious artifacts, and other hidden riches. The game combines strategic planning with addictive gameplay,\n                                                making it perfect for both casual players and mining enthusiasts. Dive into the depths and see how far you can go in Mr. Mine!\n                                            ",
        "path": "scraping/GNHUST/games_data/mr.-mine-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/mrmine.png",
        "data_players": "95k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "chicky-farm-unblocked",
        "title": "Chicky Farm Unblocked",
        "category": "Strategy",
        "subcategory": "Simulator",
        "instructions": "\n\n                                                In Chicky Farm, immerse yourself in the delightful world of fluffy friends and bountiful harvests! Hatch adorable chicks, nurture them with care, and watch them grow into happy, clucking companions. Cultivate your farm by planting crops, decorating your\n                                                land, and exploring new surprises around every corner. With vibrant graphics and engaging gameplay, Chicky Farm offers a charming escape into the joys of rural life. Join the fun today and embark on your\n                                                own egg-citing farm adventure!\n                                            ",
        "path": "scraping/GNHUST/games_data/chicky-farm-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/chickyfarm.avif",
        "data_players": "4k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "cow-bay-unblocked",
        "title": "Cow Bay Unblocked",
        "category": "Strategy",
        "subcategory": "Simulator",
        "instructions": "\n                                                Cow Bay is a delightful farming simulation game that invites you to create and manage your own idyllic rural haven. In this vibrant, open-world game, you'll cultivate crops, raise a variety of charming animals, and build and customize your dream farm.\n                                                Explore the picturesque Cow Bay, interact with friendly villagers, and embark on exciting quests to uncover hidden secrets. With its engaging gameplay and enchanting visuals, Cow Bay offers a relaxing and\n                                                immersive experience for players who love farming, creativity, and adventure. Get ready to roll up your sleeves and transform Cow Bay into your perfect countryside escape!\n                                            ",
        "path": "scraping/GNHUST/games_data/cow-bay-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/cowbay.png",
        "data_players": "89k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "idle-ants-unblocked",
        "title": "Idle Ants Unblocked",
        "category": "Strategy",
        "subcategory": "Idle",
        "instructions": "\n                                                Idle Ants is an engaging idle simulation game where you take control of an ant colony and guide it to greatness. Start with a small group of ants and manage their tasks to gather resources, build and upgrade your colony, and expand your empire. As you\n                                                progress, unlock new upgrades and features to enhance productivity and efficiency. With its intuitive gameplay and captivating progression system, Idle Ants offers a rewarding and addictive experience for\n                                                fans of strategy and incremental games. Watch your colony thrive and grow into a bustling, efficient ant empire!\n                                            ",
        "path": "scraping/GNHUST/games_data/idle-ants-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/idleants.avif",
        "data_players": "1k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "village-craft-unblocked",
        "title": "Village Craft Unblocked",
        "category": "Strategy",
        "subcategory": "Simulator",
        "instructions": "\n                                                In Village Success, you take on the role of a village leader tasked with transforming a small settlement into a bustling, prosperous community. Gather resources, construct buildings, and manage your villagers' needs as you expand your village and develop\n                                                new technologies. From farming and crafting to trade and exploration, every decision you make shapes the future of your village. With charming graphics and engaging gameplay, Village Success offers a rewarding\n                                                experience for anyone who loves strategy and simulation games. How will you guide your village to success? Play now and find out!\n                                            ",
        "path": "scraping/GNHUST/games_data/village-craft-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/villagecraft.jfif",
        "data_players": "9k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "checkers-unblocked",
        "title": "Checkers Unblocked",
        "category": "Classic",
        "subcategory": "Board Games",
        "instructions": "\n                                                Checkers is a classic two-player strategy board game where the goal is to capture or block your opponent's pieces. Players take turns moving their pieces diagonally across the board, aiming to jump over and capture their opponent's pieces while avoiding\n                                                being captured themselves. The game ends when one player captures all of their opponents pieces or blocks them from making any moves. With simple rules but deep strategic elements, Checkers is a timeless\n                                                game that offers fun and challenge for players of all ages.\n                                            ",
        "path": "scraping/GNHUST/games_data/checkers-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/checkers.png",
        "data_players": "1k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "pixel-gun-apocalypse-2-unblocked",
        "title": "Pixel Gun Apocalypse 2 Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                Embark on an adrenaline-fueled journey through Pixel Gun Apocalypse 2, where pixelated warfare meets intense multiplayer action! Engage in heart-pounding battles across a variety of dynamic maps, armed with an arsenal of weapons to unleash havoc upon\n                                                your foes. With multiple game modes to choose from and seamless gameplay, prepare for non-stop excitement and epic showdowns. Dominate the battlefield, showcase your skills, and emerge victorious in this\n                                                thrilling first-person shooter experience! This game is similar to Combat Online and Good Guys vs Bad Boys!\n                                            ",
        "path": "scraping/GNHUST/games_data/pixel-gun-apocalypse-2-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/pixelgun2.jpg",
        "data_players": "52k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "alien's-nest-unblocked",
        "title": "Alien's Nest Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                Aliens Nest is a captivating sci-fi adventure game that plunges you into an alien world teeming with danger and mystery. As an interstellar explorer, you find yourself in a labyrinthine alien hive where survival is your primary goal. Navigate through\n                                                treacherous environments, solve challenging puzzles, and face off against formidable extraterrestrial creatures. With its immersive graphics and an engaging storyline, Aliens Nest offers a thrilling experience\n                                                filled with suspense and discovery. Uncover the secrets of the alien nest and test your skills in this intense and atmospheric adventure.\n                                            ",
        "path": "scraping/GNHUST/games_data/alien's-nest-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/aliensnest.avif",
        "data_players": "8k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "n",
        "title": "n",
        "category": "Logic",
        "subcategory": "Platforming Puzzle",
        "instructions": "\n                                                N-Gon is a unique and visually captivating puzzle game that revolves around geometric shapes and strategic thinking. Dive into a minimalist world where you manipulate polygons, solve intricate puzzles, and complete levels that challenge your creativity\n                                                and logic. With its simple yet elegant design, N-Gon offers an engaging gameplay experience that's easy to learn but hard to master. Perfect for players who love puzzles and geometric patterns, the game\n                                                features endless challenges, relaxing visuals, and satisfying mechanics. Explore the endless possibilities of shapes and unlock your full potential in N-Gon!\n                                            ",
        "path": "scraping/GNHUST/games_data/n/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/n-gon.png",
        "data_players": "17k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "10-minutes-till-dawn-unblocked",
        "title": "10 Minutes Till Dawn Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                10 Minutes Till Dawn is a thrilling, action-packed survival game where you must defend yourself against relentless waves of enemies as the clock ticks down. Armed with powerful weapons and unique abilities, your goal is simple: survive for 10 intense\n                                                minutes until the dawn breaks. Each wave presents new challenges, requiring quick reflexes, strategic upgrades, and careful decision-making. As the countdown to dawn continues, the enemies grow stronger,\n                                                and the pressure increases. Will you be able to outlast the night and make it to the light? Test your survival skills in this fast-paced, high-stakes adventure.\n                                            ",
        "path": "scraping/GNHUST/games_data/10-minutes-till-dawn-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/10minutestilldawn.jpg",
        "data_players": "89k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "zombie-outbreak-arena-unblocked",
        "title": "Zombie Outbreak Arena Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n\n                                                Zombie Outbreak Arena is an intense top-down zombie shooter game that plunges you into a dark, zombie-infested world where your survival skills are put to the ultimate test. Equipped with only a gun and a flashlight, you must navigate through five challenging\n                                                levelsCross Road, Train Station, Maze, Park, and Roadeach teeming with various types of zombies lurking in the shadows. Stay alert as zombies can sneak up from the darkness, and be prepared to face different\n                                                types of zombies, each with unique behaviors. Choose to play during the day or brave the night for an additional 25% XP boost, using your flashlight to guide you. Level up by surviving waves of zombies to\n                                                earn skill points, which you can spend on enhancing your health, ammo, flashlight, and more, with a total of 40 skills available to unlock. Keep moving to avoid being overrun and look out for power-ups and\n                                                powerful weapons that spawn randomly across the map. Utilize power-ups like night vision, shields, and exploding bullets, and arm yourself with a variety of weapons, including machine guns, shotguns, and\n                                                sniper rifles, to increase your chances of survival. Immerse yourself in the game's thrilling atmosphere with its gripping soundtrack and relentless zombie action. Can you survive the zombie outbreak? Play\n                                                Zombie Outbreak Arena online for free on GNHUSTGames and find out!\n                                            ",
        "path": "scraping/GNHUST/games_data/zombie-outbreak-arena-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/zombieoutbreakarena.avif",
        "data_players": "2k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "zombie-survival-unblocked",
        "title": "Zombie Survival Unblocked",
        "category": "Skill",
        "subcategory": "Survival",
        "instructions": "\n                                                In Zombie Survival, this is an exclusive game of GNHUSTGames, the apocalypse has arrived, and the world is overrun by hordes of the undead. As one of the few remaining survivors, you must arm yourself to the teeth, fortify your position, and prepare for\n                                                an intense battle for survival. Navigate through desolate urban landscapes, eerie forests, and abandoned facilities as you scavenge for weapons, ammo, and supplies. But beware, the undead are relentless\n                                                and will stop at nothing to feast on your flesh. Strategize your every move as you face off against increasingly challenging waves of zombies. Will you barricade yourself in a secure location and defend\n                                                it with everything you've got, or will you take the fight to the enemy, hunting down the undead in a bid to reclaim the world? Besides Zombies, you also have to kill others around the world in our online\n                                                mode. Be the last survivor!\n                                            ",
        "path": "scraping/GNHUST/games_data/zombie-survival-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/zombiesurvival.jpg",
        "data_players": "4k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "die-in-the-dungeon-unblocked",
        "title": "Die in the Dungeon Unblocked",
        "category": "Logic",
        "subcategory": "Escape",
        "instructions": "\n                                                Die in the Dungeon is a unique deck-building roguelike that challenges you to conquer dungeons using dice as your weapons. Take control of a monstrous creature, battling waves of enemies in a turn-based format. Strategically roll and place different dice\n                                                to attack, defend, and gain special powers, while customizing your dice deck with upgrades and new abilities as you progress. With each dungeon dive, you'll face increasingly difficult foes and must adapt\n                                                your strategy to survive. Can you master the dice and conquer the dungeon, or will you meet your doom?\n\n\n                                            ",
        "path": "scraping/GNHUST/games_data/die-in-the-dungeon-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/dieinthedungeon.webp",
        "data_players": "59k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "jelly-truck-unblocked",
        "title": "Jelly Truck Unblocked",
        "category": "Logic",
        "subcategory": "Physics Puzzle",
        "instructions": "\n                                                Jelly Truck is a fun and quirky physics-based driving game where you navigate a truck through a world made entirely of jelly! Bounce, wobble, and squish your way across soft terrains and challenging obstacles. The squishy environment adds a unique twist\n                                                to your driving experience, requiring you to master balance and control as you tackle each level. With colorful graphics and fun mechanics, Jelly Truck offers a delightful and entertaining ride. Can you\n                                                maneuver your way through this wobbly world and reach the finish line?\n                                            ",
        "path": "scraping/GNHUST/games_data/jelly-truck-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/jellytruck.png",
        "data_players": "55k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "only-up-unblocked",
        "title": "Only Up Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Only Up is an exhilarating adventure platformer that invites players to embark on a thrilling ascent through a vibrant and whimsical world. In this unique journey, youll navigate a series of challenging obstacles, each designed to test your skills and\n                                                reflexes. As you climb higher, youll encounter stunning landscapes, hidden secrets, and unexpected twists that keep the gameplay fresh and exciting. With intuitive controls and fluid mechanics, Only Up\n                                                offers a seamless experience that encourages exploration and creativity.\n\n\n                                            ",
        "path": "scraping/GNHUST/games_data/only-up-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/onlyup.jpg",
        "data_players": "15k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "fun-obby-unblocked",
        "title": "Fun Obby Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Fun Obby is an exciting platformer game filled with challenging obstacle courses that will test your skills and reflexes. Jump, run, and dodge your way through a series of fun and colorful levels, each filled with unique traps and tricky jumps. With simple\n                                                controls and engaging gameplay, youll need quick thinking and precision to reach the finish line. Whether you're racing against the clock or just exploring for fun, Fun Obby offers endless hours of platforming\n                                                excitement for players of all ages. Are you ready to take on the ultimate obstacle challenge?\n                                            ",
        "path": "scraping/GNHUST/games_data/fun-obby-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/funobby.webp",
        "data_players": "15k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "that's-not-my-neighbor-unblocked",
        "title": "That's Not My Neighbor Unblocked",
        "category": "Logic",
        "subcategory": "Escape",
        "instructions": "\n                                                In That's Not My Neighbor, embark on a thrilling journey where every door hides a secret and every neighbor has a story. Explore a mysterious neighborhood, solving puzzles and unraveling the enigma of your peculiar neighbors. With immersive gameplay and\n                                                gripping storytelling, prepare for an unforgettable adventure filled with twists and turns. Are you ready to uncover the truth? Play now and test your detective skills in this captivating game of mystery\n                                                and suspense!\n                                            ",
        "path": "scraping/GNHUST/games_data/that's-not-my-neighbor-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/thatsnotmyneighbor.png",
        "data_players": "4k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "idle-success-unblocked",
        "title": "Idle Success Unblocked",
        "category": "Strategy",
        "subcategory": "Idle",
        "instructions": "\n                                                In Idle Success, start from humble beginnings and work your way up to the top! This engaging idle game lets you experience the journey from an ordinary individual to a successful entrepreneur, athlete, or artist. Balance your time between studying, working,\n                                                and improving your skills to unlock new opportunities. As you progress, invest in your hobbies, manage your career, and watch your life transform. With simple mechanics and addictive gameplay, Idle Success\n                                                offers endless fun as you strive to achieve your ultimate goals. How successful can you become? Play now and find out!\n                                            ",
        "path": "scraping/GNHUST/games_data/idle-success-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/idlesuccess.avif",
        "data_players": "31k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "big-shot-boxing-unblocked",
        "title": "Big Shot Boxing Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                Step into the ring with Big Shot Boxing, the ultimate boxing game where you fight your way up the rankings to secure a spot in the prestigious Boxing Hall of Fame! Begin your journey by choosing your fighter, hiring a skilled coach, and learning a variety\n                                                of powerful moves. Execute jabs, crosses, and uppercuts while keeping your guard up to outmaneuver your opponents. Unleash devastating combinations to stun your adversaries and secure victory either by scoring\n                                                the most points or delivering a knockout blow! Climb the ladder of success by training and improving crucial skills such as health, power, chin, and recovery. If you get knocked down, quickly recover within\n                                                10 seconds to stay in the fight. Earn money from your matches to customize your character’s gloves, shorts, and boots, giving you a unique look in the ring. Unlock multiple achievements by winning matches,\n                                                gaining titles, and defending your championship. With dedication and skill, you can rise to the top and claim your place in the Hall of Fame. Do you have what it takes to become a boxing legend? Play Big\n                                                Shot Boxing and prove your mettle in the ring!\n                                            ",
        "path": "scraping/GNHUST/games_data/big-shot-boxing-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/bigshotboxing.avif",
        "data_players": "17k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "tiger-simulator-3d-unblocked",
        "title": "Tiger Simulator 3D Unblocked",
        "category": "Strategy",
        "subcategory": "Simulator",
        "instructions": "\n                                                Immerse yourself in the wild with Tiger Simulator 3D, an exhilarating game that lets you live the life of a majestic tiger. Explore vast and detailed jungle environments, hunt for prey to satisfy your hunger, and raise a family to ensure the survival\n                                                of your lineage. Experience the challenges of the wild, from fierce predators to harsh weather conditions, all rendered in stunning 3D graphics. Customize your tiger, complete quests, and unlock new abilities\n                                                as you progress. With realistic gameplay and captivating visuals, Tiger Simulator 3D offers an unparalleled adventure into the heart of the jungle. Are you ready to embrace the life of a tiger?\n                                            ",
        "path": "scraping/GNHUST/games_data/tiger-simulator-3d-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/tigersimulator3d.avif",
        "data_players": "17k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "day-of-meat-radiation-unblocked",
        "title": "Day of Meat: Radiation Unblocked",
        "category": "Logic",
        "subcategory": "Building",
        "instructions": "\n                                                Day of Meat: Radiation is an intense, post-apocalyptic survival game set in a world devastated by radiation. As the player, you must navigate a harsh environment where mutated creatures, toxic landscapes, and scarce resources pose constant threats. Explore\n                                                ruined cities, underground bunkers, and radioactive zones in search of supplies, weapons, and shelter to ensure your survival. The game challenges you with a blend of combat, resource management, and exploration.\n                                                You'll face deadly encounters with mutated beasts and hostile factions while managing your health, radiation levels, and hunger. Craft and upgrade your gear using scavenged materials, and make tough decisions\n                                                that will affect your journey and survival.\n                                            ",
        "path": "scraping/GNHUST/games_data/day-of-meat-radiation-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/dayofmeat.avif",
        "data_players": "1k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "james-gun-unblocked",
        "title": "James Gun Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                Step into the shoes of a legendary marksman in James Gun, an adrenaline-fueled action game that will keep you on the edge of your seat! Embark on a series of thrilling missions where you'll use your sharpshooting skills to take down enemies, complete\n                                                challenging objectives, and uncover the secrets of a gripping storyline. With intuitive controls and dynamic gameplay, James Gun offers a variety of environments to explore, from bustling urban landscapes\n                                                to treacherous terrains. Upgrade your weapons, hone your skills, and strategize your approach to overcome formidable foes. Whether you’re a fan of intense shootouts or tactical gameplay, James Gun delivers\n                                                an exhilarating experience that will keep you engaged. Are you ready to prove your marksmanship and become a legend in the world of James Gun?\n\n\n                                            ",
        "path": "scraping/GNHUST/games_data/james-gun-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/jamesgun.png",
        "data_players": "4k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "gunspin-unblocked",
        "title": "GunSpin Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                GunSpin is a fun and addictive shooting game where your goal is to launch a gun as far as possible by firing it in mid-air. With each shot, you'll propel your weapon forward, aiming to reach the longest distance. Unlock a variety of powerful guns, each\n                                                with unique stats, and master the art of perfect timing to keep your gun flying. Simple to play but challenging to master, GunSpin offers endless fun as you try to beat your high score and upgrade your arsenal.\n                                                How far can you shoot your way to victory?\n                                            ",
        "path": "scraping/GNHUST/games_data/gunspin-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/gunspin.png",
        "data_players": "82k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "flip-bros-unblocked",
        "title": "Flip Bros Unblocked",
        "category": "Logic",
        "subcategory": "Platforming Puzzle",
        "instructions": "\n\n                                                In Flip Bros, embark on an adrenaline-fueled journey where gravity is just a suggestion. Take control of the dynamic duo as they flip, spin, and leap through a series of mind-bending levels filled with obstacles and challenges. With intuitive controls\n                                                and seamless gameplay, master the art of defying gravity and unleash your acrobatic skills to overcome every hurdle in your path. Explore vibrant worlds, encounter quirky characters, and test your reflexes\n                                                in this addictive platformer adventure. Are you ready to flip the script and conquer the game? Let the flipping begin!\n                                            ",
        "path": "scraping/GNHUST/games_data/flip-bros-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/flipbros.avif",
        "data_players": "19k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "bullet-bros-unblocked",
        "title": "Bullet Bros Unblocked",
        "category": "Logic",
        "subcategory": "Platforming Puzzle",
        "instructions": "\n                                                Bullet Bros is the thrilling sequel to Flip Bros, adding a powerful gun to the fun platforming action. Use recoil to propel yourself through the air, rotate, and blast enemies. Unlock cool outfits and powerful guns as you progress. Gear up and get ready\n                                                for an explosive adventure!\n                                            ",
        "path": "scraping/GNHUST/games_data/bullet-bros-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/bulletbros.jpg",
        "data_players": "45k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "stickman-hook-unblocked",
        "title": "Stickman Hook Unblocked",
        "category": "Logic",
        "subcategory": "Physics Puzzle",
        "instructions": "\n                                                Stickman Hook is a thrilling and addictive mobile game where players control a stick figure character swinging through various levels filled with obstacles using a grappling hook. The objective is to swing as far as possible while navigating through challenging\n                                                courses. Swing the stick figure character through the level by using a grappling hook and avoid obstacles to reach the furthest distance possible.\n                                            ",
        "path": "scraping/GNHUST/games_data/stickman-hook-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/stickmanhook.png",
        "data_players": "21k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "i-was-so-hungry-unblocked",
        "title": "I Was So Hungry Unblocked",
        "category": "Classic",
        "subcategory": "Other",
        "instructions": "\n                                                Step into the shoes of a desperate survivor in I Was So Hungry, a gripping survival game where hunger isn’t just a necessity—it’s your greatest adversary. Stranded in an unforgiving world, every decision you make revolves around one question: How will\n                                                you satisfy your relentless hunger? Scavenge through desolate environments, hunt for scarce resources, and fend off dangers lurking in the shadows. Each choice has consequences as you balance the need for\n                                                sustenance with your survival instincts. Will you take risks for a chance at a feast, or play it safe and endure the pangs of starvation?\n                                            ",
        "path": "scraping/GNHUST/games_data/i-was-so-hungry-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/iwassohungry.png",
        "data_players": "18k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "human-or-not-unblocked",
        "title": "Human or not Unblocked",
        "category": "Logic",
        "subcategory": "Trivia",
        "instructions": "\n                                                Human or not is a fascinating and interactive game that puts your perception and intuition to the test. Engage in short conversations and determine whether you're chatting with a human or an AI. With its intriguing concept and unpredictable outcomes,\n                                                the game challenges you to think critically about communication and the subtle cues that distinguish humans from machines. Perfect for fans of social experiments, AI technology, or just a fun challenge,\n                                                Human or not offers a unique experience that will keep you guessing. Dive in and see if you can tell the difference—play now!\n                                            ",
        "path": "scraping/GNHUST/games_data/human-or-not-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/humanornot.webp",
        "data_players": "76k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "santy-is-home-unblocked",
        "title": "Santy is Home Unblocked",
        "category": "Logic",
        "subcategory": "Platforming Puzzle",
        "instructions": "\n                                                Santy is Home is a heartwarming adventure game that follows the journey of Santy, a lovable and determined character, as he strives to find his way back home. In this story-driven puzzle platformer, players must help Santy navigate through a series of\n                                                beautifully designed levels filled with challenges, obstacles, and hidden secrets. The game features a charming, colorful art style and a soothing soundtrack, creating an immersive and cozy atmosphere as\n                                                you progress through Santy’s journey. Solve puzzles, overcome environmental obstacles, and discover clues that will guide you closer to Santy’s home. Along the way, you’ll encounter quirky characters, unlock\n                                                new abilities, and experience moments of heartwarming storytelling.\n                                            ",
        "path": "scraping/GNHUST/games_data/santy-is-home-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/santyishome.png",
        "data_players": "92k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "burger-&-frights-unblocked",
        "title": "Burger & Frights Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                Burger & Frights is a spine-tingling horror game that takes you on a seemingly simple late-night bike ride to grab a burger. What starts as a quiet journey through dark, desolate roads soon turns into a nightmare filled with eerie surprises, supernatural\n                                                encounters, and chilling mysteries. With immersive first-person gameplay, haunting visuals, and a gripping storyline, Burger & Frights keeps you on edge as you unravel its sinister secrets. Perfect for fans\n                                                of horror and suspense, this game delivers an unforgettable and heart-pounding experience. Can you survive the night? Play now to find out!\n                                            ",
        "path": "scraping/GNHUST/games_data/burger-&-frights-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/burger&frights.png",
        "data_players": "0k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "seven-days-in-purgatory-unblocked",
        "title": "Seven Days in Purgatory Unblocked",
        "category": "Logic",
        "subcategory": "Platforming Puzzle",
        "instructions": "\n\n                                                Seven Days in Purgatory is an engaging and comical indie game that puts you in the role of a gatekeeper tasked with judging souls entering the afterlife. Over the course of seven days, you'll face a variety of moral dilemmas and challenging decisions\n                                                as you determine the fate of each soul that crosses your path. With a blend of humor and thought-provoking scenarios, the game explores themes of justice, empathy, and the complexities of human nature. Your\n                                                choices will shape the experience, leading to different outcomes and encouraging multiple playthroughs. Dive into this unique adventure and see if you have what it takes to balance the scales of fate!\n                                            ",
        "path": "scraping/GNHUST/games_data/seven-days-in-purgatory-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/sdip.jpg",
        "data_players": "3k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "the-baby-in-yellow-unblocked",
        "title": "The Baby in Yellow Unblocked",
        "category": "Logic",
        "subcategory": "Escape",
        "instructions": "\n                                                In The Baby in Yellow, prepare for an unnerving journey into the unknown. As darkness falls, you find yourself alone in a dimly lit house, with only the unsettling presence of a mysterious baby for company. With each creak of the floorboards and every\n                                                flicker of the lights, tension mounts as you unravel the secrets lurking within the shadows. Can you survive the night and uncover the truth behind the eerie Baby in Yellow? Brace yourself for a spine-chilling\n                                                experience that will keep you on the edge of your seat until the very end.\n                                            ",
        "path": "scraping/GNHUST/games_data/the-baby-in-yellow-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/thebabyinyellow.webp",
        "data_players": "9k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "five-night-at-freddy's-unblocked",
        "title": "Five Night at Freddy's Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                FnaF, short for Five Nights at Freddy's, is a critically acclaimed horror-themed video game franchise developed by Scott Cawthon. Set in a fictional pizza restaurant called Freddy Fazbear's Pizza, the game follows the terrifying experiences of a nighttime\n                                                security guard tasked with monitoring the facility's security cameras to survive against animatronic characters that come to life after hours. In each installment of the series, players find themselves in\n                                                the security office of the restaurant, equipped with a limited amount of power to control the security cameras and electronic doors. The primary goal is to survive five consecutive nights while fending off\n                                                attacks from the animatronics, which become increasingly aggressive and unpredictable as the nights progress.\n                                            ",
        "path": "scraping/GNHUST/games_data/five-night-at-freddy's-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/fnaf.jpg",
        "data_players": "13k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "forgotten-hill-the-wardrobe-unblocked",
        "title": "Forgotten Hill: The Wardrobe Unblocked",
        "category": "Logic",
        "subcategory": "Escape",
        "instructions": "\n                                                Forgotten Hill: The Wardrobe is a terrifying point-and-click adventure developed by FM Studio. After returning home from boarding school, you discover that your brother is gravely ill, and the cause seems to be linked to the relentless creatures lurking\n                                                in the shadows, eager to play a deadly game with him. As you explore the eerie Anderson house, solve intricate puzzles to uncover the truth and find a cure for your brother. Delve deeper into the mystery\n                                                of the sinister wardrobe in one of the rooms and uncover how it connects to your brother's plight. With its spine-chilling atmosphere and challenging puzzles, Forgotten Hill: The Wardrobe will keep you on\n                                                edge as you navigate through the horrors that lie within. Are you ready to face the dark secrets of the Anderson house?\n                                            ",
        "path": "scraping/GNHUST/games_data/forgotten-hill-the-wardrobe-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/forgottenhill.png",
        "data_players": "3k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "forgotten-hill-memento-love-beyond-unblocked",
        "title": "Forgotten Hill Memento: Love Beyond Unblocked",
        "category": "Logic",
        "subcategory": "Escape",
        "instructions": "\n                                                Forgotten Hill Memento: Love Beyond is a hauntingly immersive adventure that delves into the eerie and enigmatic world of Forgotten Hill. In this gripping puzzle horror game, youll explore a mysterious mansion filled with dark secrets and unsettling\n                                                creatures. Unravel the twisted story of love and obsession as you solve intricate puzzles and face disturbing challenges. With its atmospheric visuals, chilling soundtrack, and intricate narrative, Love\n                                                Beyond will test your wits and courage. Can you uncover the truth behind the mansions haunting past and escape the shadows of Forgotten Hill?\n\n\n                                            ",
        "path": "scraping/GNHUST/games_data/forgotten-hill-memento-love-beyond-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/forgottenhillmemento.avif",
        "data_players": "19k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "shape-fold-unblocked",
        "title": "Shape Fold Unblocked",
        "category": "Logic",
        "subcategory": "Physics Puzzle",
        "instructions": "\n                                                Shape Fold is a unique and engaging puzzle game that challenges your spatial reasoning and creativity. In this game, you'll work with geometric shapes, folding and combining them to complete intricate patterns and designs. Each level presents a new and\n                                                interesting puzzle, requiring careful thought and strategy to solve. With its smooth mechanics and satisfying visual feedback, Shape Fold offers a relaxing yet stimulating experience for puzzle lovers. Test\n                                                your problem-solving skills and enjoy the rewarding process of crafting perfect shapes in this innovative puzzle adventure!\n                                            ",
        "path": "scraping/GNHUST/games_data/shape-fold-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/shapefold.webp",
        "data_players": "15k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "raft-life-unblocked",
        "title": "Raft Life Unblocked",
        "category": "Strategy",
        "subcategory": "Simulator",
        "instructions": "\n                                                Welcome to Raft Life, the ultimate test of survival on the open sea! Cast adrift on a small raft in the vast ocean, you must gather resources, build your shelter, and fend off the dangers that lurk beneath the waves. From battling hunger and thirst to\n                                                braving unpredictable weather conditions, every decision counts as you strive to turn your humble raft into a floating oasis. Explore the endless expanse of the ocean, craft essential tools, and uncover\n                                                secrets hidden within the depths. Can you conquer the challenges of Raft Life and emerge as the master of your aquatic domain? Dive in now and embark on the adventure of a lifetime!\n                                            ",
        "path": "scraping/GNHUST/games_data/raft-life-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/raftlife.png",
        "data_players": "3k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "shell-shockers-unblocked",
        "title": "Shell Shockers Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                Shell Shockers is an exhilarating multiplayer first-person shooter game where players battle it out as armed eggs in a high-octane arena. With its fast-paced gameplay and unique concept, Shell Shockers offers a fun and addictive experience for players\n                                                of all skill levels. Choose your weapon, customize your egg, and dive into the fray to crack your opponents and emerge victorious. Whether you're blasting enemies solo or teaming up with friends, Shell Shockers\n                                                delivers egg-citing action that will keep you coming back for more!\n                                            ",
        "path": "scraping/GNHUST/games_data/shell-shockers-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/shellshockers.png",
        "data_players": "1k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "house-of-hazards-unblocked",
        "title": "House of Hazards Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                House of Hazards is an uproarious multiplayer party game that pits you against your friends in a series of absurd challenges within a treacherous household. Prepare for chaotic hilarity as you navigate through rooms filled with unpredictable traps, obstacles,\n                                                and puzzles, all while competing to be the last one standing. With a variety of game modes and countless ways to outwit and outmaneuver your opponents, House of Hazards guarantees endless laughter and memorable\n                                                moments. Gather your friends, brace yourself for mayhem, and embark on an unforgettable journey through this wacky and unpredictable household!",
        "path": "scraping/GNHUST/games_data/house-of-hazards-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/houseofhazards.avif",
        "data_players": "2k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "my-perfect-hotel-unblocked",
        "title": "My Perfect Hotel Unblocked",
        "category": "Strategy",
        "subcategory": "Simulator",
        "instructions": "\n\n                                                My Perfect Hotel is a captivating hotel management game where you create and oversee your dream hospitality empire. Start small, upgrading rooms and facilities to attract more guests. Hire and manage staff, ensure top-notch customer satisfaction, and\n                                                expand your hotel into a luxurious retreat. With its engaging gameplay, charming visuals, and endless customization options, My Perfect Hotel offers a fun and relaxing experience for players who love building\n                                                and managing their own businesses. Can you create the perfect getaway for your guests? The challenge awaits!\n                                            ",
        "path": "scraping/GNHUST/games_data/my-perfect-hotel-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/myperfecthotel.png",
        "data_players": "2k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "paint-strike-unblocked",
        "title": "Paint Strike Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                Paint Strike is an exhilarating and vibrant shooter that turns combat into a colorful spectacle. In this fast-paced game, youll face off against opponents using high-powered paint blasters in a variety of dynamic arenas. Strategize your moves, dodge\n                                                paint attacks, and unleash a rainbow of colors to outmaneuver your rivals. With its engaging gameplay, visually striking graphics, and a range of creative paint weapons, Paint Strike offers a unique and\n                                                thrilling experience. Gear up, get ready to paint the town, and prove your skills in this action-packed, paint-splattered battle!\n                                            ",
        "path": "scraping/GNHUST/games_data/paint-strike-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/paintstrike.avif",
        "data_players": "2k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "hide-and-smash-unblocked",
        "title": "Hide and Smash Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n\n                                                Experience an exhilarating twist on the classic hide and seek game with Hide and Smash! Players are randomly assigned to either the blue hide team or the red smash team, each with a unique mission. As a hider, your task is to move quietly and swiftly,\n                                                blend in with your surroundings by pretending to be a normal object, and collect all the keys before being discovered and smashed by your opponents. If you're a smasher, your objective is to find and smash\n                                                the cleverly hidden opponents camouflaged as various objects before they gather all the keys. It's a thrilling battle of strength and wits. Can you outsmart and outlast your opponents? Join the game and\n                                                find outlet's hide and smash!\n                                            ",
        "path": "scraping/GNHUST/games_data/hide-and-smash-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/hideandsmash.avif",
        "data_players": "96k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "hide-from-school-unblocked",
        "title": "Hide from School Unblocked",
        "category": "Skill",
        "subcategory": "Escape",
        "instructions": "\n                                                Enjoy the feeling of escaping the classroom in the game Hide from School. An exclusive game by GNHUSTGames. You will be a student who must escape from the classroom being watched by the teacher. After each round, use money to buy items, items such as\n                                                baseball bats will be scattered throughout the classroom. Pick it up and you can attack the teacher. Each round after the challenge will be more difficult.\n                                            ",
        "path": "scraping/GNHUST/games_data/hide-from-school-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/hidefromschool.png",
        "data_players": "2k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "fancy-pants-3-unblocked",
        "title": "Fancy Pants 3 Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Fancy Pants 3 continues the beloved platformer adventure with Fancy Pants Man as he embarks on a thrilling new quest. Traverse beautifully hand-drawn levels filled with unique challenges, tricky obstacles, and quirky enemies. Enjoy the smooth, fast-paced\n                                                gameplay that the series is known for, with improved mechanics and new moves to master. Collect squiggles, discover secrets, and unlock stylish outfits as you explore this vibrant and dynamic world. Whether\n                                                you're a long-time fan or new to the series, Fancy Pants 3 offers endless fun and excitement in a whimsical and action-packed journey.\n                                            ",
        "path": "scraping/GNHUST/games_data/fancy-pants-3-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/fancypants3.avif",
        "data_players": "2k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "fleeing-the-complex-unblocked",
        "title": "Fleeing the Complex Unblocked",
        "category": "Logic",
        "subcategory": "Escape",
        "instructions": "\n                                                Fleeing the Complex is an engaging and suspenseful escape game that challenges you to break out of a high-security prison known as 'The Wall.' As the protagonist, you’ll face a series of tough decisions, each leading to different paths and multiple possible\n                                                endings. The game combines clever puzzles, humorous scenarios, and intense moments as you interact with other inmates, outsmart guards, and explore various escape routes. Your choices will determine whether\n                                                you succeed or end up back in your cell. Can you find the way to freedom?\n                                            ",
        "path": "scraping/GNHUST/games_data/fleeing-the-complex-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/fleeingthecomplex.avif",
        "data_players": "1k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "breaking-the-bank-unblocked",
        "title": "Breaking the Bank Unblocked",
        "category": "Logic",
        "subcategory": "Escape",
        "instructions": "\n                                                Breaking the Bank is the first thrilling installment of the beloved Henry Stickmin game series. In this adventure, you assist Henry Stickmin in his daring attempt to rob a bank situated in the heart of a desert. Players are presented with a variety of\n                                                risky and hilarious methods to achieve this goal. You can dig tunnels, set off explosives, drill with lasers, demolish with wrecking balls, use teleporters, or even try a clever disguise. Each choice leads\n                                                to a unique and often unexpected outcome, encouraging multiple playthroughs to discover all possible endings. Breaking the Bank combines strategic decision-making with humor, ensuring an entertaining experience\n                                                for players of all ages. Play Breaking the Bank and other Henry Stickmin games for free online on GNHUSTGames, and dive into this exciting world of stick-figure heists and comedic capers.\n                                            ",
        "path": "scraping/GNHUST/games_data/breaking-the-bank-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/breakingthebank.avif",
        "data_players": "11k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "funny-shooter-2-unblocked",
        "title": "Funny Shooter 2 Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                Welcome to the whimsical world of Funny Shooter 2, where laughter is the best weapon! Join an array of quirky characters in this uproarious multiplayer game, where every match promises a riotous good time. Armed with an assortment of outrageous weapons\n                                                and set in delightfully absurd arenas, chaos and hilarity ensue with each shot fired. Whether you're battling friends or facing off against AI opponents, the unpredictable gameplay guarantees endless entertainment.\n                                                So, gather your friends, brace yourself for laughter, and jump into the madness of Funny Shooter 2!\n                                            ",
        "path": "scraping/GNHUST/games_data/funny-shooter-2-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/funnyshooter2.png",
        "data_players": "8k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "funny-blade-&-magic-unblocked",
        "title": "Funny Blade & Magic Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                Don't click on the in-game ads because we have turned them off, if you click right , take f5. After each level, instead of watching ads, f5 again and continue to the next level. Your progress will stay the same! In \"Funny Blade and Magic,\" prepare to\n                                                embark on an uproarious adventure unlike any other! Meet Blunder Blade, the clumsiest knight in the realm, and his equally hapless companion, Merlin the Magnificently Misguided. Together, they stumble through\n                                                dungeons, face off against hilariously sinister foes, and embark on quests that are anything but straightforward. With its blend of slapstick humor and charmingly inept characters, this game promises endless\n                                                laughter and whimsical mayhem at every turn. Watch as spells backfire, enemies are transformed into chickens, and chaos ensues in the most unexpected ways.\n                                            ",
        "path": "scraping/GNHUST/games_data/funny-blade-&-magic-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/funnybladeandmagic.jpg",
        "data_players": "83k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "12-minibattles-unblocked",
        "title": "12 Minibattles Unblocked",
        "category": "Classic",
        "subcategory": "Other",
        "instructions": "\n                                                12 Minibattles is a roguelike action-adventure game developed by Edmund McMillen and Florian Himsl. It is inspired by the biblical story of Isaac and focuses on exploration, combat, and the acquisition of power-ups and items. The game features randomly\n                                                generated dungeons, various enemies, and challenging boss battles.",
        "path": "scraping/GNHUST/games_data/12-minibattles-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/12minibattles.jpg",
        "data_players": "12k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "temple-of-boom-unblocked",
        "title": "Temple of Boom Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                Temple of Boom is an electrifying multiplayer shooting game that immerses players in the heart of an ancient temple filled with danger and excitement. Assemble your team and dive into intense battles against other players, navigating through intricate\n                                                mazes and avoiding deadly traps while unleashing a barrage of firepower upon your foes. With a wide array of weapons, power-ups, and customizable characters at your disposal, every match in Temple of Boom\n                                                is a thrilling test of skill and strategy. Whether you prefer close-quarters combat with shotguns or long-range precision with sniper rifles, there's a weapon to suit every playstyle.\n                                            ",
        "path": "scraping/GNHUST/games_data/temple-of-boom-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/templeofboom.avif",
        "data_players": "0k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "wrassling-unblocked",
        "title": "Wrassling Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Wrassling is a riotous arcade web game crafted by Colin Lane Games, hitting screens in 2019 with uproarious wrestling action. Your objective? It's simple: throw your opponents out of the ring! But don't be fooled by the simplicity; this game pits you\n                                                against multiple fighters simultaneously, adding a layer of chaos to the ring. Swing your arms, perform bodyslams, and expertly toss your foes over the ropes in a battle for supremacy. As you progress, unlock\n                                                a colorful array of hats and goals, adding to the zany fun of this addictive wrestling extravaganza. Brace yourself for a dose of hilarious mayhem as you grapple your way to victory in Wrassling!\n                                            ",
        "path": "scraping/GNHUST/games_data/wrassling-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/wrassling.jpg",
        "data_players": "3k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "hills-of-steel-unblocked",
        "title": "Hills of Steel Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                Hills of Steel thrusts you into the heart-pounding world of armored warfare, where you take command of formidable tanks in exhilarating battles. With intuitive controls and explosive action, engage in adrenaline-fueled skirmishes against players from\n                                                around the globe. Customize your tanks with a diverse array of upgrades and weapons, from heavy cannons to rapid-fire machine guns, and devise cunning strategies to outmaneuver your foes on diverse terrain.\n                                                Whether you prefer solo missions or team-based showdowns, Hills of Steel offers endless thrills and challenges. Are you ready to dominate the battlefield and prove your mastery of steel? Join the fight now!\n                                            ",
        "path": "scraping/GNHUST/games_data/hills-of-steel-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/hillsofsteel.avif",
        "data_players": "7k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "smash-karts-unblocked",
        "title": "Smash Karts Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                Smash Karts is an exhilarating online multiplayer game that injects high-octane action into the classic kart racing genre. Developed by Sydney-based studio, Miniclip, Smash Karts delivers adrenaline-fueled races with a twist: intense combat where players\n                                                engage in chaotic battles to outmaneuver and outgun their opponents. In Smash Karts, players hop into their customizable karts and dive into vibrant, colorful arenas filled with obstacles, power-ups, and\n                                                rivals. The objective? Race to the finish line while blasting opponents off the track using an array of fantastical weapons and gadgets.\n                                            ",
        "path": "scraping/GNHUST/games_data/smash-karts-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/smashkarts.jpg",
        "data_players": "35k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "temple-run-2-unblocked",
        "title": "Temple Run 2 Unblocked",
        "category": "Skill",
        "subcategory": "Endless Runner",
        "instructions": "\n                                                Temple Run 2 is an electrifying sequel to the wildly popular endless running game, Temple Run. In this adrenaline-pumping adventure, players find themselves in the heart of ancient ruins, navigating perilous pathways filled with obstacles, traps, and\n                                                challenges. As you sprint through the temple's twisting corridors, you'll need lightning-fast reflexes to leap over gaping chasms, slide under low-hanging obstacles, and evade the clutches of demonic monkeys\n                                                hot on your heels. Along the way, collect valuable coins and power-ups that will aid in your quest to outrun the curse of the temple. With stunning graphics, immersive sound effects, and responsive touch\n                                                controls, Temple Run 2 delivers an action-packed gaming experience that will keep you on the edge of your seat. As you progress through the game, unlock new characters, abilities, and environments, each\n                                                more thrilling than the last.\n                                            ",
        "path": "scraping/GNHUST/games_data/temple-run-2-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/templerun2.png",
        "data_players": "2k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "rooftop-snipers-unblocked",
        "title": "Rooftop Snipers Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                Rooftop Snipers is a rather chaotic two-button sniper game where you can only shoot and jump. You can play the game with a friend or against the computer. It's one of our many great two-player games that you can play with friends! Find a friend to play\n                                                with or practice by playing against the computer. The game is simple but will be frustrating due to the limited movement, but that's what makes it fun to play. To win the round, you must push your opponents\n                                                away by shooting them.",
        "path": "scraping/GNHUST/games_data/rooftop-snipers-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/rooftopsniper.avif",
        "data_players": "2k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "getaway-shootout-unblocked",
        "title": "Getaway Shootout Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Getaway Shootout is a thrilling and fast-paced multiplayer online game that combines platforming and shooting elements. In this game, players compete against each other in a series of action-packed levels to be the first to reach the getaway vehicle while\n                                                overcoming various obstacles and outmaneuvering opponents. The game features simple yet engaging 2D graphics with quirky characters and vibrant, colorful environments. Players control unique characters with\n                                                distinctive appearances, each with its own set of abilities and traits. The objective is to race through a series of levels, each with different layouts and challenges, and reach the getaway vehicle before\n                                                your opponents.",
        "path": "scraping/GNHUST/games_data/getaway-shootout-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/getawayshootout.jpg",
        "data_players": "11k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "murder-unblocked",
        "title": "Murder Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n\n                                                Murder is a thrilling assassination game developed by Studio Seufz. Sneak up behind the king and eliminate him swiftly and silently, but beware - getting caught means a one-way trip to the dungeon! Play as a cunning vizier plotting his ascent to the throne,\n                                                but watch out, as your own adviser may be eyeing your crown. Dive into the world of Murder online, directly from your browser with GNHUSTGames, and put your observation and reaction skills to the test. It's\n                                                free to play, but a single misstep could mean the end of your reign - or your life.\n                                            ",
        "path": "scraping/GNHUST/games_data/murder-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/murder.avif",
        "data_players": "3k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "superhot-unblocked",
        "title": "SuperHot Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                SuperHot is an innovative first-person shooter that combines sleek, minimalist design with intense, strategic gameplay. In a world where time only progresses when you move, each action becomes a calculated decision. Dodge bullets in slow motion, disarm\n                                                enemies, and navigate through a series of increasingly challenging scenarios. With its unique time-bending mechanic, SuperHot transforms every battle into a puzzle where reflexes and strategy are equally\n                                                vital. There are no health bars, no regenerating ammojust you, surrounded by enemies, with the odds stacked against you.\n                                            ",
        "path": "scraping/GNHUST/games_data/superhot-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/superhot.jpg",
        "data_players": "24k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "time-shooter-2-unblocked",
        "title": "Time Shooter 2 Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                Embark on an exhilarating journey through time with Time Shooter 2, the ultimate multiplayer experience that blends futuristic warfare with historical settings. Armed with advanced weaponry and tactical prowess, players dive into intense battles across\n                                                pivotal moments in history. Rewrite the past or safeguard the future as you engage in adrenaline-fueled combat against friends and foes alike. With immersive gameplay and stunning visuals, Time Shooter 2\n                                                offers an unmatched gaming experience that will keep you on the edge of your seat. Ready to make your mark on history? Step into the time-traveling battlefield and prove your skills in Time Shooter 2!\n                                            ",
        "path": "scraping/GNHUST/games_data/time-shooter-2-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/timeshooter2.png",
        "data_players": "11k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "time-shooter-3-unblocked",
        "title": "Time Shooter 3 Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                Embark on an exhilarating voyage across time and space with Time Shooter 3! This is the sequel game to Time Shooter 2. In this gripping multiplayer experience, players wield futuristic weaponry to traverse historical epochs and shape the course of history.\n                                                Engage in adrenaline-fueled battles across meticulously crafted landscapes, where every shot fired could alter the timeline. With stunning visuals and immersive gameplay, Time Shooter 3 offers a thrilling\n                                                blend of action and strategy. Will you rewrite the past or secure the future? The fate of the universe is in your hands. Step into the time-traveling battlefield and carve your legacy in Time Shooter 3!\n                                            ",
        "path": "scraping/GNHUST/games_data/time-shooter-3-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/timeshooter3.avif",
        "data_players": "16k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "short-ride-unblocked",
        "title": "Short Ride Unblocked",
        "category": "Skill",
        "subcategory": "Endless Runner",
        "instructions": "\n\n                                                In Short Ride, get ready for a pulse-pounding experience filled with thrills and challenges! Navigate through a series of treacherous obstacles, from perilous cliffs to deadly traps, as you ride various vehicles in this adrenaline-fueled adventure. Test\n                                                your skills and reflexes as you race against the clock to reach the finish line in one piece. With its dynamic physics-based gameplay and intense action, Short Ride will keep you on the edge of your seat\n                                                for every heart-pounding moment. Are you brave enough to conquer the ride? Play now and find out!\n                                            ",
        "path": "scraping/GNHUST/games_data/short-ride-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/shortride.avif",
        "data_players": "6k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "short-life-2-unblocked",
        "title": "Short Life 2 Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Short Life 2 is a unique and thrilling platformer where you must rely on your survival skills to navigate through numerous dangerous obstacles. Dodge spikes, swinging blades, and explosive mines as you strive to survive each tricky level. The better you\n                                                are at avoiding death, the more stars you'll collect, allowing you to unlock and play as various characters. Guide our heroes through different stages and show off your survival prowess to your friends in\n                                                this unforgiving and action-packed game. How long can you last? Play Short Life 2 and find out!\n                                            ",
        "path": "scraping/GNHUST/games_data/short-life-2-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/shortlife.png",
        "data_players": "10k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "we-become-what-we-behold-unblocked",
        "title": "We Become What We Behold Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                We Become What We Behold is a thought-provoking indie game that explores the fascinating dynamics of society and human behavior. Through the lens of a camera lens, players observe and capture the interactions of various characters in a bustling world.\n                                                As the game progresses, the consequences of the player's observations become apparent, highlighting how our perceptions can shape reality. With its minimalist art style and engaging gameplay mechanics, We\n                                                Become What We Behold offers a unique and introspective gaming experience that challenges players to consider the impact of their observations on the world around them.\n                                            ",
        "path": "scraping/GNHUST/games_data/we-become-what-we-behold-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/wbwwb.avif",
        "data_players": "70k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "george-and-the-printer-unblocked",
        "title": "George and the Printer Unblocked",
        "category": "Logic",
        "subcategory": "Platforming Puzzle",
        "instructions": "\n                                                George and the Printer is a fun and quirky puzzle adventure game that follows George, a determined character on a mission to fix a series of printing mishaps in a world where printers are more than just machinestheyre part of the adventure! Players\n                                                must guide George through a variety of creative puzzles and challenges centered around the theme of printing, paper, and quirky mechanical contraptions. Each level presents unique obstacles that require\n                                                you to think critically and solve problems in innovative ways. From jamming printers to out-of-place pages, youll need to fix the misprints, navigate mazes of paper, and avoid printer-induced hazards. Along\n                                                the way, youll encounter amusing characters, collect helpful tools, and uncover the mysteries of this paper-filled world.\n                                            ",
        "path": "scraping/GNHUST/games_data/george-and-the-printer-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/georgeandtheprinter.png",
        "data_players": "19k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "stick-merge-unblocked",
        "title": "Stick Merge Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                In Stick Merge, embark on a captivating journey of strategic fusion and conquest. Merge stick figures to unlock powerful new characters, strengthen your army, and dominate the battlefield. With intuitive gameplay mechanics and endless possibilities for\n                                                combination, the challenge lies in your ability to merge wisely and efficiently. Test your strategic prowess as you evolve your army and expand your influence. Are you ready to merge, multiply, and emerge\n                                                victorious in Stick Merge? Join the adventure now and become the ultimate stick figure commander!\n                                            ",
        "path": "scraping/GNHUST/games_data/stick-merge-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/stickmerge.avif",
        "data_players": "1k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "chicken-merge-unblocked",
        "title": "Chicken Merge Unblocked",
        "category": "Simulator",
        "subcategory": "Idle",
        "instructions": "\n                                                Welcome to Chicken Merge, the delightful merging game where clucking creativity meets strategic fun! In this colorful adventure, youll combine adorable chickens to create new breeds and expand your charming farm. Start with basic chickens and merge them\n                                                to unlock unique varieties, each with its own special traits. As you progress, gather resources and upgrade your farm to attract even more feathered friends. With vibrant graphics and engaging gameplay,\n                                                Chicken Merge offers a captivating experience for players of all ages. Challenge yourself to discover all the chicken breeds, complete fun quests, and build the ultimate chicken empire. Are you ready to\n                                                cluck your way to success? Dive into the world of Chicken Merge today!\n\n\n                                            ",
        "path": "scraping/GNHUST/games_data/chicken-merge-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/chickenmerge.png",
        "data_players": "51k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "ragdoll-hit-unblocked",
        "title": "Ragdoll Hit Unblocked",
        "category": "Skill",
        "subcategory": "Other",
        "instructions": "\n                                                In the chaotic realm of Ragdoll Hit, players are thrust into the heart of intense combat, where the only law is survival of the fittest. From the ingenious minds behind Ragdoll Archers comes this adrenaline-pumping action game, designed to test your skills\n                                                and reflexes to the limit. As a nimble ragdoll stickman, you'll face off against a relentless onslaught of enemies, each more formidable than the last. With a dynamic arsenal of punches, kicks, jumps, and\n                                                an assortment of weapons at your disposal, every encounter becomes a thrilling test of strategy and precision. But victory isn't just about brute force. To triumph in Ragdoll Hit, players must master the\n                                                art of adaptation, utilizing the surrounding environment to gain a crucial edge over their adversaries. From makeshift barricades to strategically placed hazards, every element becomes a weapon in your hands.\n                                                As you emerge victorious from each hard-fought battle, you'll earn precious coins that can be used to unlock an array of powerful weapons and stylish skins, customizing your ragdoll fighter to suit your\n                                                unique style. Prepare to enter a world where chaos reigns supreme and only the strongest survive. Can you rise to the challenge and claim your place as the ultimate champion of Ragdoll Hit?\n                                            ",
        "path": "scraping/GNHUST/games_data/ragdoll-hit-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/ragdollhit.avif",
        "data_players": "59k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "stickman-fight-ragdoll-unblocked",
        "title": "Stickman Fight Ragdoll Unblocked",
        "category": "Skill",
        "subcategory": "Other",
        "instructions": "\n                                                Stickman Fight Ragdoll is a wildly entertaining fighting game where ragdoll physics create hilarious and unpredictable battles. Step into the shoes of a stickman warrior and engage in over-the-top brawls against quirky opponents. Control your stickmans\n                                                every move and perform outrageous stunts as you fight to outwit and outmaneuver your foes. With its unique physics-based combat and comical animations, Stickman Fight Ragdoll offers endless fun and excitement.\n                                                Perfect for players looking for a light-hearted and chaotic fighting experience, this game invites you to embrace the absurdity and master the art of stickman warfare!\n\n\n                                            ",
        "path": "scraping/GNHUST/games_data/stickman-fight-ragdoll-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/stickmanfightragdoll.png",
        "data_players": "34k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "age-of-war-unblocked",
        "title": "Age of War Unblocked",
        "category": "Strategy",
        "subcategory": "Simulator",
        "instructions": "\n                                                Age of War is a captivating strategy game that takes players on an epic journey through time, challenging them to build and defend their civilization against relentless enemies. Developed by Max Games Studios, this thrilling game combines elements of\n                                                strategy, defense, and warfare into an addictive gameplay experience. In Age of War, players start in the Stone Age with primitive weaponry and technology. Their goal is to evolve their civilization through\n                                                various historical eras, from the dawn of humanity to the far reaches of futuristic warfare. As players progress, they must manage resources, research new technologies, and train armies to fend off attacks\n                                                from rival civilizations.\n                                            ",
        "path": "scraping/GNHUST/games_data/age-of-war-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/ageofwar.jpeg",
        "data_players": "16k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "geometry-dash-unblocked",
        "title": "Geometry Dash Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Geometry Dash is an electrifying and addictive rhythm-based platformer game that challenges players with navigating through a series of treacherous obstacles and levels. Developed by RobTop Games, this critically acclaimed game offers a unique blend of\n                                                fast-paced gameplay, pulsating music, and geometric visuals. In Geometry Dash, players control a customizable square-shaped character, guiding it through a variety of levels filled with spikes, saw blades,\n                                                and other hazards. The game is known for its precise controls and timing-based mechanics, requiring players to jump, fly, and flip their way through each level with split-second precision. One of the defining\n                                                features of Geometry Dash is its dynamic soundtrack, with each level synchronized to the beat of the music. Players must time their movements to the rhythm, adding an extra layer of challenge and immersion\n                                                to the gameplay experience.\n                                            ",
        "path": "scraping/GNHUST/games_data/geometry-dash-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/geometrydash.png",
        "data_players": "11k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "tunnel-rush-unblocked",
        "title": "Tunnel Rush Unblocked",
        "category": "Skill",
        "subcategory": "Endless Runner",
        "instructions": "\n                                                Tunnel Rush is a thrilling and adrenaline-pumping mobile game that challenges players to navigate through an endless, neon-infused tunnel filled with obstacles and traps. Developed by Deer Cat, this high-speed game offers an intense and immersive experience\n                                                that tests players' reflexes and agility to the limit. In Tunnel Rush, players find themselves hurtling through a vibrant and visually stunning tunnel at breakneck speeds. The tunnel twists and turns unpredictably,\n                                                while obstacles and barriers appear suddenly, requiring split-second reactions to avoid collisions and keep progressing.\n                                            ",
        "path": "scraping/GNHUST/games_data/tunnel-rush-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/tunnelrush.jpg",
        "data_players": "11k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "block-blast-unblocked",
        "title": "Block Blast Unblocked",
        "category": "Logic",
        "subcategory": "Building",
        "instructions": "\n                                                Block Blast is a captivating puzzle game that combines strategy and fun. In this game, you’ll match and clear colorful blocks to complete each level. With hundreds of challenging levels, unique boosters, and stunning visuals, Block Blast will keep you\n                                                entertained for hours. Test your skills, plan your moves carefully, and blast through obstacles to reach the next level. Whether you're a casual gamer or a puzzle expert, Block Blast offers endless excitement\n                                                and brain-teasing fun!\n                                            ",
        "path": "scraping/GNHUST/games_data/block-blast-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/blockblast.jpg",
        "data_players": "1k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "toss-the-turtle-unblocked",
        "title": "Toss the Turtle Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                Toss the Turtle is an action-packed launching game where your goal is to send your turtle flying as far as possible! Use cannons, explosives, jetpacks, and more to propel your turtle through the sky. Along the way, smash through obstacles, collect coins,\n                                                and unlock crazy upgrades, weapons, and characters. With each launch, you’ll aim to break distance records, discover new areas, and cause massive chaos. How far can you toss your turtle?\n                                            ",
        "path": "scraping/GNHUST/games_data/toss-the-turtle-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/tosstheturtle.png",
        "data_players": "52k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "dino-bros-unblocked",
        "title": "Dino Bros Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Dino Bros is a delightful platformer game that takes you on a prehistoric adventure with two charming dinosaur brothers. Help the Dino Bros navigate through a variety of exciting levels filled with obstacles, enemies, and puzzles. Use their unique abilities\n                                                to overcome challenges and unlock new stages. With vibrant graphics, intuitive controls, and engaging gameplay, Dino Bros offers fun for players of all ages. Whether you're dodging dangers or solving puzzles,\n                                                every moment is packed with excitement. Embark on this captivating journey and see how far you can go with the Dino Bros!\n                                            ",
        "path": "scraping/GNHUST/games_data/dino-bros-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/dinobros.avif",
        "data_players": "24k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "tiny-fishing-unblocked",
        "title": "Tiny Fishing Unblocked",
        "category": "Strategy",
        "subcategory": "Simulator",
        "instructions": "\n                                                Tiny Fishing is a charming and addictive mobile game that transports players to a peaceful lakeside retreat where they can enjoy the serene art of fishing. Developed by Tactile Games, this delightful game offers a relaxing and immersive experience that\n                                                appeals to players of all ages. In Tiny Fishing, players embark on a tranquil fishing adventure, casting their lines into the sparkling waters of picturesque lakes and ponds. The game features adorable pixel\n                                                art graphics and soothing background music that create a calming atmosphere, perfect for unwinding and escaping the hustle and bustle of everyday life.\n                                            ",
        "path": "scraping/GNHUST/games_data/tiny-fishing-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/tinyfishing.avif",
        "data_players": "7k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "tag-2-unblocked",
        "title": "TAG 2 Unblocked",
        "category": "Skill",
        "subcategory": "Endless Runner",
        "instructions": "\n                                                Tag 2 takes the game of tag you know and love to a whole new level! When the timer runs out and you’re holding the bomb, it’s game over. So jump through portals, use bouncy pads and run as fast as you can to avoid the player who’s it! If you’re up for\n                                                a real challenge, try out Zombie mode. There’s lots of Runners to unlock and daily quests to complete, so there’s always something to do. Play by yourself or add up to 4 friends to the chaotic fun! Can you\n                                                win this ultimate game of Tag?\n                                            ",
        "path": "scraping/GNHUST/games_data/tag-2-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/tag2.avif",
        "data_players": "87k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "stick-war-unblocked",
        "title": "Stick War Unblocked",
        "category": "Strategy",
        "subcategory": "Simulator",
        "instructions": "\n                                                Step into the world of Stick War, where strategic brilliance reigns supreme! Lead your stick figure army into battle against formidable foes, employing cunning tactics and resource management to emerge victorious. Command troops, gather resources, and\n                                                unleash powerful spells as you strive to conquer your enemies and assert dominance over the land. With engaging gameplay and challenging levels, Stick War offers an immersive experience that will keep you\n                                                glued to your screen for hours on end. Are you ready to lead your army to glory? Play Stick War now and unleash your strategic prowess!\n                                            ",
        "path": "scraping/GNHUST/games_data/stick-war-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/stickwar.avif",
        "data_players": "28k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "stickman-archero-fight-unblocked",
        "title": "Stickman Archero Fight Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                Stickman Archero Fight plunges you into an exhilarating, action-packed adventure where every moment is a battle for survival. As a brave stickman warrior, you'll embark on an epic journey, facing off against countless foes with a diverse arsenal at your\n                                                disposal. Whether you prefer the precision of a bow, the brute force of an axe, or the swift strikes of a sword, the game offers a wide range of weapons to master. But that's not all—everyday objects like\n                                                boxes and tablets can be turned into lethal tools of destruction, adding a creative twist to your combat strategy. The game challenges you to look at your surroundings and make the most of them, turning\n                                                anything you find into an instrument of war. As you progress through the levels, each victory not only brings you closer to your ultimate goal but also makes you stronger and more skilled. The more battles\n                                                you survive, the tougher and more formidable you become. Are you ready to dive into this ultimate stickman fight? Embrace the chaos, hone your skills, and become the unstoppable force that no enemy can withstand.\n                                                The battlefield awaits your legend to be written!\n                                            ",
        "path": "scraping/GNHUST/games_data/stickman-archero-fight-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/stickmanarcherofight.avif",
        "data_players": "0k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "thumb-fighter-unblocked",
        "title": "Thumb Fighter Unblocked",
        "category": "Classic",
        "subcategory": "Trivia",
        "instructions": "\n                                                Thumb Fighter is the ultimate test of thumb supremacy! Engage in frantic battles against friends or the computer in this wildly entertaining game. Use your thumb to squash, flick, and thumb-wrestle your way to victory. With simple controls and hilarious\n                                                gameplay, Thumb Fighter guarantees endless hours of fun. Will your thumb reign supreme? Play now and find out!",
        "path": "scraping/GNHUST/games_data/thumb-fighter-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/thumbfighter.avif",
        "data_players": "14k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "happy-wheels-unblocked",
        "title": "Happy Wheels Unblocked",
        "category": "Logic",
        "subcategory": "Physics Puzzle",
        "instructions": "\n                                                Happy Wheels is an engaging and unconventional physics-based browser game known for its dark humor and challenging obstacle courses. Players control characters in different vehicles through dangerous levels filled with traps and hazards. Navigate through\n                                                obstacle courses while avoiding deadly traps to reach the finish line with your character intact.\n                                            ",
        "path": "scraping/GNHUST/games_data/happy-wheels-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/happywheel.png",
        "data_players": "5k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "happy-room-unblocked",
        "title": "Happy Room Unblocked",
        "category": "Logic",
        "subcategory": "Physics Puzzle",
        "instructions": "\n                                                Happy Room is a physics-based sandbox game that puts your creativity and destructive tendencies to the test. In this game, you're tasked with experimenting on crash test dummies using a vast array of weapons and traps. From explosives and saws to lasers\n                                                and guns, the possibilities are endless. Each experiment aims to inflict maximum damage to earn points and unlock new tools. With its engaging mechanics and endless combinations, Happy Room offers hours\n                                                of addictive and thrilling gameplay. Unleash your inner mad scientist and see how much havoc you can wreak in the ultimate testing chamber!\n                                            ",
        "path": "scraping/GNHUST/games_data/happy-room-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/happyroom.webp",
        "data_players": "3k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "getting-over-it-unblocked",
        "title": "Getting Over It Unblocked",
        "category": "Logic",
        "subcategory": "Physics Puzzle",
        "instructions": "\n                                                Prepare for an extraordinary test of skill and resilience in Getting Over It. Navigate through a surreal world as a cat trapped in a cauldron, armed with nothing but a hammer. With every move, conquer obstacles and ascend a treacherous mountain landscape\n                                                filled with pitfalls and challenges. Simple controls belie the complexity of the physics-based gameplay, making each success a triumph of determination. Will you persevere and conquer the mountain, or will\n                                                frustration get the better of you? Dive into the unique experience of Getting Over It and discover the true meaning of perseverance.\n                                            ",
        "path": "scraping/GNHUST/games_data/getting-over-it-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/gettingoverit.avif",
        "data_players": "19k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "slice-master-unblocked",
        "title": "Slice Master Unblocked",
        "category": "Skill",
        "subcategory": "Endless Runner",
        "instructions": "\n                                                Slice Master is an exhilarating action game that puts your reflexes and precision to the test. As the Slice Master, your mission is to slice through a variety of objects, from fruits and vegetables to challenging obstacles, with swift and accurate swipes.\n                                                Each level brings new challenges and requires quick thinking and sharp timing to achieve high scores. With stunning graphics, dynamic gameplay, and a variety of modes, Slice Master offers endless slicing\n                                                fun and excitement. Hone your skills, master your technique, and become the ultimate Slice Master!\n                                            ",
        "path": "scraping/GNHUST/games_data/slice-master-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/slicemaster.png",
        "data_players": "25k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "fruit-ninja-unblocked",
        "title": "Fruit Ninja Unblocked",
        "category": "Skill",
        "subcategory": "Endless Runner",
        "instructions": "\n                                                Fruit Ninja is a fast-paced action game that delivers endless slicing fun. As a ninja with lightning-fast reflexes, your mission is to slice through waves of juicy fruit while avoiding deadly bombs. The gameplay is simple yet addictive—swipe your finger\n                                                across the screen to cut through fruit and rack up points. With various game modes, power-ups, and challenges, Fruit Ninja offers a dynamic experience that keeps you coming back for more. Whether you’re\n                                                aiming for a high score or just looking to relieve some stress, Fruit Ninja provides a satisfying blend of excitement and strategy that’s perfect for players of all ages.\n                                            ",
        "path": "scraping/GNHUST/games_data/fruit-ninja-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/fruitninja.jpg",
        "data_players": "1k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "fruit-merge-unblocked",
        "title": "Fruit Merge Unblocked",
        "category": "Logic",
        "subcategory": "Physics Puzzle",
        "instructions": "\n                                                Fruit Merge is an engaging and colorful puzzle game that invites players to dive into a delicious world of fruity fun! In this delightful adventure, you’ll combine and match various fruits to create powerful combinations and unlock exciting new levels.\n                                                With simple yet addictive gameplay, Fruit Merge challenges you to strategically merge fruits of the same type, forming larger and more potent fruits that can help you overcome obstacles and complete fun\n                                                puzzles. As you progress through vibrant and beautifully designed levels, you’ll encounter unique challenges that will test your problem-solving skills and creativity.\n                                            ",
        "path": "scraping/GNHUST/games_data/fruit-merge-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/fruitmerge.webp",
        "data_players": "42k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "eaglercraft-unblocked",
        "title": "EaglerCraft Unblocked",
        "category": "Logic",
        "subcategory": "Building",
        "instructions": "\n                                                Eaglercraft is a sandbox-style video game renowned for its open-world exploration, creative building, and survival elements. Players can unleash their creativity, explore vast procedurally generated worlds, and craft their adventures. Objective: The game\n                                                offers multiple modes, including Survival, Creative, Adventure, and more, each with its own objectives. Survival Mode: Players gather resources, build shelters, craft tools, and survive against various challenges\n                                                like monsters and environmental hazards. Creative Mode: Unrestricted access to resources and the ability to fly, allowing boundless creation without worrying about health or hunger.\n                                            ",
        "path": "scraping/GNHUST/games_data/eaglercraft-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/eaglecraft.png",
        "data_players": "54k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "hole.io-unblocked",
        "title": "Hole.io Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                Hole.io is a thrilling multiplayer game where players control a voracious black hole on a mission to consume everything in its path and grow as large as possible. Set in a bustling cityscape, players must navigate their hole through streets, parks, and\n                                                buildings, swallowing up objects, vehicles, and even other players. As you consume more objects, your hole grows larger, allowing you to devour bigger obstacles and outmaneuver opponents. With each successful\n                                                gulp, you earn points and climb the leaderboard, vying for the title of the biggest and most formidable hole in the city.\n                                            ",
        "path": "scraping/GNHUST/games_data/hole.io-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/holeio.jpg",
        "data_players": "18k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "armedforces.io-unblocked",
        "title": "ArmedForces.io Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                ArmedForces.io is an action-packed, multiplayer online game that plunges players into intense combat scenarios within various military settings. Developed by a team of seasoned game developers, this browser-based game offers a thrilling combination of\n                                                strategy, teamwork, and fast-paced action. Upon entering the game, players are prompted to choose their preferred military faction from a selection of diverse options, each with its own unique strengths,\n                                                weaknesses, and special abilities. Whether commanding a modern elite special forces unit, piloting advanced fighter jets, or leading a battalion of armored vehicles, players must leverage their faction's\n                                                capabilities to dominate the battlefield.\n                                            ",
        "path": "scraping/GNHUST/games_data/armedforces.io-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/armedforces.jpg",
        "data_players": "5k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "among-us-unblocked",
        "title": "Among Us Unblocked",
        "category": "Strategy",
        "subcategory": "Simulator",
        "instructions": "\n                                                Among Us is an addictive online multiplayer game that tests your wit, strategy, and social deduction skills. Set aboard a spaceship or a space station, players are divided into crewmates and impostors. With its simple yet engaging gameplay and quirky\n                                                graphics, Among Us offers endless hours of fun and excitement. Whether you're collaborating with friends to uncover the truth or plotting devious schemes as an impostor, every match is filled with suspense\n                                                and unpredictability.\n                                            ",
        "path": "scraping/GNHUST/games_data/among-us-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/amongus.jpg",
        "data_players": "81k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "backrooms-unblocked",
        "title": "Backrooms Unblocked",
        "category": "Strategy",
        "subcategory": "Escape",
        "instructions": "\n                                                In the hauntingly immersive world of the Backrooms game, players find themselves trapped in a bizarre, ever-shifting maze of interconnected rooms. Inspired by the enigmatic internet urban legend, this game plunges adventurers into a surreal journey where\n                                                reality bends and twists with each step. With every corner turned, players encounter a new layer of the unsettling unknown. From dimly lit hallways to eerie abandoned spaces, the atmosphere is thick with\n                                                tension and mystery. Evading lurking entities and navigating through endless, randomly generated levels, players must rely on their wit and courage to survive.\n                                            ",
        "path": "scraping/GNHUST/games_data/backrooms-unblocked/",
        "imgpath": "https://gnhustgames.github.io/imagetet/backrooms.png",
        "data_players": "66k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "baldi's-basics-unblocked",
        "title": "Baldi's Basics Unblocked",
        "category": "Classic",
        "subcategory": "Retro",
        "instructions": "\n                                                Baldi's Basics is a surreal and hilarious horror game that takes the educational genre to bizarre new heights. Players find themselves trapped inside a seemingly ordinary school, but things quickly take a turn for the absurd as they encounter the enigmatic\n                                                and unsettling figure of Baldi, the teacher. Armed with a collection of math problems, players must navigate the school's bizarre corridors, collecting notebooks while avoiding Baldi's wrath. But beware:\n                                                with each notebook collected, Baldi's speed increases, making escape all the more challenging. As players progress, they encounter a cast of eccentric characters, each adding to the game's quirky charm.\n                                                From talking brooms to sentient notebooks, Baldi's Basics is a delightfully off-kilter experience that keeps players on their toes with its unpredictable twists and turns. With its retro-inspired graphics\n                                                and tongue-in-cheek humor, Baldi's Basics has garnered a dedicated following and become a cult classic in the indie gaming scene. Whether you're a fan of horror games or simply looking for a good laugh,\n                                                Baldi's Basics is sure to entertain and surprise you at every turn.\n                                            ",
        "path": "scraping/GNHUST/games_data/baldi's-basics-unblocked/",
        "imgpath": "https://gnhustgames.github.io/imagetet/baldisbasics.png",
        "data_players": "34k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "crazy-cars-unblocked",
        "title": "Crazy Cars Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                Crazy Cars is a colorful car racing game in an open world where you must collect dozens of stars and some wrenches to repair your vehicle when you suffer a small accident. Do everything in your power to accumulate enough money to buy new and exciting\n                                                cars of the latest generation, get to your destination, drift, jump without fear, perform unique aerial stunts and land on all four wheels to reach victory without a single scratch. Good luck!\n                                            ",
        "path": "scraping/GNHUST/games_data/crazy-cars-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/crazycars.webp",
        "data_players": "3k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "crossy-road-unblocked",
        "title": "Crossy Road Unblocked",
        "category": "Skill",
        "subcategory": "Endless Runner",
        "instructions": "\n                                                Crossy Road is a popular endless arcade-style PC game that requires players to guide a character across a series of busy roads, rivers, and train tracks while avoiding obstacles and trying to achieve the highest score possible.The primary goal is to navigate\n                                                a character as far as possible without getting hit by moving obstacles or falling into water.\n                                            ",
        "path": "scraping/GNHUST/games_data/crossy-road-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/crossyroad.png",
        "data_players": "11k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "five-night-at-freddy's-unblocked",
        "title": "Five Night at Freddy's Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                FnaF, short for Five Nights at Freddy's, is a critically acclaimed horror-themed video game franchise developed by Scott Cawthon. Set in a fictional pizza restaurant called Freddy Fazbear's Pizza, the game follows the terrifying experiences of a nighttime\n                                                security guard tasked with monitoring the facility's security cameras to survive against animatronic characters that come to life after hours. In each installment of the series, players find themselves in\n                                                the security office of the restaurant, equipped with a limited amount of power to control the security cameras and electronic doors. The primary goal is to survive five consecutive nights while fending off\n                                                attacks from the animatronics, which become increasingly aggressive and unpredictable as the nights progress.\n                                            ",
        "path": "scraping/GNHUST/games_data/five-night-at-freddy's-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/fnaf.jpg",
        "data_players": "1k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "run-3-unblocked",
        "title": "Run 3 Unblocked",
        "category": "Skill",
        "subcategory": "Endless Runner",
        "instructions": "\n                                                Run 3 is an exhilarating endless running game that takes players on an intergalactic journey through futuristic tunnels. With its minimalist design and intuitive controls, players navigate through increasingly challenging levels while defying gravity\n                                                and overcoming obstacles. As you progress, new characters and levels unlock, adding depth and excitement to the gameplay experience. Test your reflexes and endurance as you strive to run as far as possible\n                                                in this addictive and visually stunning game.\n                                            ",
        "path": "scraping/GNHUST/games_data/run-3-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/run3.avif",
        "data_players": "48k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "dreadhead-parkour-unblocked",
        "title": "Dreadhead Parkour Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Dreadhead Parkour is a heart-pounding mobile game that combines the thrill of parkour with intense platforming challenges. Developed by an independent studio, this adrenaline-fueled game offers players an exhilarating experience as they navigate through\n                                                urban landscapes filled with obstacles and hazards. In Dreadhead Parkour, players assume the role of a skilled parkour runner with a distinctive dreadlocked hairstyle, navigating through dynamic and visually\n                                                stunning environments. From skyscraper rooftops to bustling city streets, each level presents a unique set of challenges that test players' reflexes, agility, and timing.\n                                            ",
        "path": "scraping/GNHUST/games_data/dreadhead-parkour-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/dreadheadparkour.jpg",
        "data_players": "3k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "gobble-unblocked",
        "title": "Gobble Unblocked",
        "category": "Logic",
        "subcategory": "Platforming Puzzle",
        "instructions": "\n Welcome to Gobble, the addictive arcade game that will test your reflexes and puzzle-solving skills! In Gobble, you control a quirky mouth in the ground with one simple mission: eat everything in sight except for people! Navigate through various themed\n levels, gobbling up objects like cacti, rocks, trees, and boxes while avoiding humans to progress. Each level introduces new tricks and challenges that will keep you on your toes. Solve intricate puzzles\n that build upon previous ones, ensuring a fresh and engaging experience every time you play. Use your wits and speed to overcome obstacles, collect power-ups, and achieve the highest scores.\n ",
        "path": "scraping/GNHUST/games_data/gobble-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/gobble.avif",
        "data_players": "13k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "eugene's-life-unblocked",
        "title": "Eugene's Life Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n Join the epic elastic adventure in Eugene's Life, a vibrant platform game by Gametornado. Navigate a colorful plasticine world as a clay character on a mission to save the world. Inflate, jump, squeeze, and bounce through perilous obstacles. Solve challenging\n puzzles with a variety of tools, machines, and mechanisms. Are you ready to conquer the ultimate platforming quest?\n ",
        "path": "scraping/GNHUST/games_data/eugene's-life-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/eugeneslife.png",
        "data_players": "16k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "poor-eddie-unblocked",
        "title": "Poor Eddie Unblocked",
        "category": "Logic",
        "subcategory": "Platforming Puzzle",
        "instructions": "\n Poor Eddie is a whimsical puzzle-platformer that invites you to embark on an imaginative journey with Eddie, a lovable character whose luck seems to have run out. Navigate through creatively designed levels filled with quirky challenges, clever puzzles,\n and unexpected surprises. As Eddie, you’ll need to use your wits and agility to overcome obstacles, solve intricate puzzles, and uncover hidden secrets. With its charming art style and engaging gameplay,\n Poor Eddie offers a delightful experience for players of all ages. Can you help Eddie turn his misfortunes into triumphs and restore his luck?\n\n\n ",
        "path": "scraping/GNHUST/games_data/poor-eddie-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/pooreddie.avif",
        "data_players": "17k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "bottle-flip-3d-unblocked",
        "title": "Bottle Flip 3D Unblocked",
        "category": "Skill",
        "subcategory": "Stacking",
        "instructions": "\n Bottle Flip 3D is an engaging and addictive arcade game that challenges players to flip a virtual bottle and land it upright on various surfaces. With simple yet intuitive controls, the game allows players to flick and spin the bottle as they navigate\n through increasingly difficult levels filled with obstacles and unique challenges. Set in vibrant, dynamic environments, Bottle Flip 3D offers a variety of settings, from kitchen counters to rooftops, each\n presenting new opportunities and hurdles. Players can enjoy smooth gameplay and realistic physics, making every flip feel satisfying and rewarding.\n\n\n ",
        "path": "scraping/GNHUST/games_data/bottle-flip-3d-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/bottleflip3d.png",
        "data_players": "12k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "sprunki-incredibox-unblocked",
        "title": "Sprunki Incredibox Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n Sprunki Incredibox is an interactive music game that lets you become the DJ and create your own tracks by mixing beats, melodies, and vocal effects. Choose from a variety of characters, each with their own unique sound, and drag and drop different elements\n to build your musical masterpiece. With its intuitive interface, vibrant visuals, and endless creative possibilities, Sprunki Incredibox is perfect for music lovers of all ages. Whether you're a beginner\n or a seasoned beatmaker, this game lets you explore rhythm and sound in a fun and engaging way!\n ",
        "path": "scraping/GNHUST/games_data/sprunki-incredibox-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/sprunkiincredibox.jpg",
        "data_players": "2k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "friday-night-funkin-unblocked",
        "title": "Friday Night Funkin Unblocked",
        "category": "Skill",
        "subcategory": "Other",
        "instructions": "\n Friday Night Funkin' is a rhythm-based indie game that combines music, style, and fun challenges. Join the protagonist, Boyfriend, on a quest to win over Girlfriend's heart by impressing her father through rap battles. Navigate through catchy tunes, face\n off against a variety of quirky opponents, and groove to the beat to claim victory. With its retro-inspired visuals and addictive gameplay, Friday Night Funkin' offers a unique and entertaining experience\n for players of all ages. So, grab your microphone and get ready to show off your rhythm skills in this exciting musical adventure!\n ",
        "path": "scraping/GNHUST/games_data/friday-night-funkin-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/fnf.png",
        "data_players": "0k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "friday-night-funkin'-vs-xe-unblocked",
        "title": "Friday Night Funkin' vs Xe Unblocked",
        "category": "Skill",
        "subcategory": "Other",
        "instructions": "\n Friday Night Funkin' vs Xe is an exciting mod for the popular rhythm game Friday Night Funkin'. This mod introduces new opponents, including the enigmatic Xe, who brings fresh challenges and unique tracks to the game. Players must use their rhythm skills\n to hit the right notes and defeat Xe in a series of intense musical battles. With vibrant new characters, catchy songs, and engaging gameplay, Friday Night Funkin' vs Xe offers a thrilling experience for\n both new and seasoned players. Dive into the groove and show off your rhythm prowess in this exhilarating addition to the Friday Night Funkin' universe!\n ",
        "path": "scraping/GNHUST/games_data/friday-night-funkin'-vs-xe-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/fnfvsxe.jpg",
        "data_players": "6k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "tag-unblocked",
        "title": "TAG Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n Step into the heart-pounding world of TAG, where stealth, strategy, and quick reflexes reign supreme! In this adrenaline-fueled multiplayer game, you'll take on the role of either the hunter or the hunted. As the hunter, use your cunning skills to track\n down and capture your elusive prey. But if you find yourself as the hunted, employ every trick in the book to evade capture and outsmart your pursuers. With fast-paced gameplay and intense action around\n every corner, TAG will keep you on the edge of your seat. So, are you ready to embrace the challenge and prove your skills in the ultimate game of cat and mouse? Join the chase in TAG now!\n ",
        "path": "scraping/GNHUST/games_data/tag-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/tag.avif",
        "data_players": "98k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "football-legends-unblocked",
        "title": "Football Legends Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n Step onto the pitch and experience the thrill of the world's most beloved sport in Football Legends, the ultimate football game that brings together the greatest players of all time! Whether you're a seasoned fan or a newcomer to the sport, Football Legends\n offers an immersive and exhilarating gameplay experience that will keep you on the edge of your seat. Choose from a roster of legendary players spanning different eras and teams, each meticulously crafted\n to capture their unique skills, style, and personality. From the graceful dribbling of Pelé to the thunderous strikes of Cristiano Ronaldo, every player brings their own strengths to the game, allowing you\n to build your dream team and dominate the competition. Take your team to the top in a variety of game modes, including quick matches, tournaments, and career mode. In quick matches, you can jump straight\n into the action for a fast-paced game that's perfect for a quick gaming session. Tournaments offer a more challenging experience as you compete against other teams to claim the ultimate prize. And in career\n mode, you'll embark on a journey to lead your team to glory, from lower league obscurity to international fame.\n ",
        "path": "scraping/GNHUST/games_data/football-legends-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/footballlegends.avif",
        "data_players": "0k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "basketball-legends-unblocked",
        "title": "Basketball Legends Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n Basketball Legends invites you to step onto the virtual court and showcase your skills in an electrifying online basketball experience. Take control of some of the greatest basketball stars of all time as you dribble, dunk, and shoot your way to victory\n against formidable opponents. With smooth gameplay and intuitive controls, Basketball Legends delivers an immersive gaming experience for players of all levels. Whether you're a seasoned baller or just starting\n out, this game offers thrilling matches, epic dunks, and intense competition. Are you ready to lace up your sneakers and become a legend on the hardwood? Play Basketball Legends now and show the world your\n hoop dreams!\n\n ",
        "path": "scraping/GNHUST/games_data/basketball-legends-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/basketballlegends.avif",
        "data_players": "0k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "fury-wars-unblocked",
        "title": "Fury Wars Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n In Fury Wars, immerse yourself in the heart-pounding world of fast-paced multiplayer action! Assemble your squad of fearless heroes, each with their unique abilities and weaponry, and dive into the battlegrounds where every move counts. From strategic\n team play to adrenaline-fueled solo missions, unleash chaos across dynamic arenas. With stunning graphics and intuitive controls, Fury Wars delivers non-stop excitement for players craving intense shooting\n action. Join the battle today and show your skills in the ultimate test of strength and strategy!\n ",
        "path": "scraping/GNHUST/games_data/fury-wars-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/furywars.avif",
        "data_players": "50k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "moto-x3m-winter-unblocked",
        "title": "Moto X3M Winter Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n Moto X3M Winter is an action-packed motorbike racing game that will test your skills on icy terrains and snow-covered tracks. Buckle up and prepare for an adrenaline rush as you navigate through a series of challenging levels filled with obstacles and\n traps. Perform daring stunts and flips to earn extra points, but beware of the treacherous terrain that can send you flying off course. With its fast-paced gameplay and stunning winter landscapes, Moto X3M\n Winter promises hours of thrilling entertainment for players of all ages. Strap on your helmet and get ready to conquer the cold in this exciting winter racing adventure!\n ",
        "path": "scraping/GNHUST/games_data/moto-x3m-winter-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/motox3mwinter.avif",
        "data_players": "58k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "choppy-orc-unblocked",
        "title": "Choppy Orc Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n Choppy Orc is a retro-style adventure game where you control a brave orc armed with a powerful axe. Your mission is to navigate through challenging levels, chopping down obstacles and solving clever puzzles to rescue trapped allies. With only your axe\n to throw and retrieve, each level requires precise timing and strategy. From dangerous pits to tricky enemies, every stage offers unique challenges to overcome. Perfect for fans of classic platformers, Choppy\n Orc combines simple controls with engaging puzzles. Will you master the axe and save the day?\n ",
        "path": "scraping/GNHUST/games_data/choppy-orc-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/choppyorc.webp",
        "data_players": "11k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "superfighters-unblocked",
        "title": "Superfighters Unblocked",
        "category": "Skill",
        "subcategory": "FPS",
        "instructions": "\n                                                Superfighters is an adrenaline-filled action game that puts your combat skills to the test. Dive into chaotic multiplayer battles or face off against challenging AI in a variety of dynamic arenas. Choose from a vast arsenal of weapons, from guns and explosives\n                                                to melee tools, to defeat your opponents. The game’s fast-paced gameplay, destructible environments, and strategic elements make every match unique and thrilling. Whether you're playing solo or teaming up\n                                                with friends, Superfighters delivers non-stop action and excitement. Outsmart, outgun, and outlast your rivals to become the ultimate champion!\n                                            ",
        "path": "scraping/GNHUST/games_data/superfighters-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/superfighters.jpg",
        "data_players": "3k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "izowave",
        "title": "IZOWAVE",
        "category": "Strategy",
        "subcategory": "Tower Defense",
        "instructions": "\n                                                In IZOWAVE - Build and Defend, plunge into an exhilarating realm where your strategic prowess is the key to survival. Craft and fortify your base amidst a dynamic, ever-changing landscape, brimming with perilous threats. Harness your ingenuity to erect\n                                                formidable defenses while fending off relentless waves of enemies. With each victory, unlock new technologies and expand your arsenal to secure your dominion. Are you ready to construct your legacy and defend\n                                                it against all odds? Prepare for the ultimate test of strategy in IZOWAVE - Build and Defend.\n                                            ",
        "path": "scraping/GNHUST/games_data/izowave/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/izowave.avif",
        "data_players": "18k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "junior-chess-unblocked",
        "title": "Junior Chess Unblocked",
        "category": "Classic",
        "subcategory": "Board Games",
        "instructions": "\n                                                Dive into the world of Junior Chess, the perfect game for young minds eager to master the classic game of strategy and skill. This vibrant and interactive version of chess is designed to make learning fun and accessible for beginners while still providing\n                                                challenges for more advanced players. Plan your moves carefully, visualize your strategies, and watch as your skills improve. With adjustable difficulty levels, Junior Chess grows with you, making it an\n                                                excellent choice for players of all ages and abilities. Join the adventure and see if your king will come out on top!\n                                            ",
        "path": "scraping/GNHUST/games_data/junior-chess-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/jrchess.avif",
        "data_players": "53k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "idle-breakout-unblocked",
        "title": "Idle Breakout Unblocked",
        "category": "Strategy",
        "subcategory": "Idle",
        "instructions": "\n                                                Idle Breakout is a captivating idle game that offers a fresh twist on the classic brick-breaking genre. In this addictive game, players start with a simple paddle and ball, tasked with breaking through layers of bricks to progress to new levels. What\n                                                sets Idle Breakout apart is its idle gameplay mechanics, allowing players to automate the ball's movement and upgrade their paddle's abilities over time. As you earn points from breaking bricks, you can\n                                                invest in various upgrades to increase the speed of the ball, enhance paddle size, and unlock powerful abilities.\n                                            ",
        "path": "scraping/GNHUST/games_data/idle-breakout-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/idlebreakout.png",
        "data_players": "7k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "grind-craft-unblocked",
        "title": "Grind Craft Unblocked",
        "category": "Logic",
        "subcategory": "Building",
        "instructions": "\n                                                Dive into the enchanting world of GrindCraft, where creativity meets adventure! In this captivating crafting game, you’ll gather resources, explore unique landscapes, and construct impressive structures. With intuitive mechanics and engaging gameplay,\n                                                you can easily craft a variety of items and expand your virtual realm. Start your journey by mining resources and gathering materials, then use your crafting skills to build anything from simple tools to\n                                                grand monuments. As you progress, unlock new recipes and discover hidden treasures that enhance your crafting experience. Whether you’re a seasoned gamer or new to crafting games, GrindCraft offers endless\n                                                possibilities for creativity and exploration. Join a vibrant community of crafters and embark on a thrilling adventure today!\n                                            ",
        "path": "scraping/GNHUST/games_data/grind-craft-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/grindcraft.png",
        "data_players": "17k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "a-dark-room-unblocked",
        "title": "A Dark Room Unblocked",
        "category": "Strategy",
        "subcategory": "Simulator",
        "instructions": "\n                                                A Dark Room is a minimalist, text-based survival game that begins in a cold, dark room with no memory of how you got there. As you gather resources, build structures, and uncover hidden secrets, you slowly unravel the mystery of your surroundings. The\n                                                game evolves from simple resource management to a deep and engaging story, where every decision impacts your survival and the world around you. With its minimalist design, eerie atmosphere, and intriguing\n                                                plot twists, A Dark Room offers a unique experience that will keep you hooked until the very end. Will you uncover the truth and survive the darkness?\n                                            ",
        "path": "scraping/GNHUST/games_data/a-dark-room-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/adarkroom.png",
        "data_players": "4k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "little-alchemy-2-unblocked",
        "title": "Little Alchemy 2 Unblocked",
        "category": "Logic",
        "subcategory": "Physics Puzzle",
        "instructions": "\n                                                Little Alchemy 2 is an engaging and addictive puzzle game that invites players to explore the wonders of creation through experimentation and discovery. Building upon the success of its predecessor, Little Alchemy, this sequel offers an expanded universe\n                                                of elements and combinations to uncover. In Little Alchemy 2, players start with a few basic elements, such as air, water, earth, and fire. By combining these elements in various ways, players can create\n                                                new elements, objects, and phenomena. The game encourages creativity and critical thinking as players experiment with different combinations to unlock new discoveries.\n                                            ",
        "path": "scraping/GNHUST/games_data/little-alchemy-2-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/littlealchemy.webp",
        "data_players": "19k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "cat-room-blast-unblocked",
        "title": "Cat Room Blast Unblocked",
        "category": "Logic",
        "subcategory": "Platforming Puzzle",
        "instructions": "\n                                                Cat Room Blast is a charming match-3 puzzle game that lets you immerse yourself in a world of cute cats and creative home decor. Solve colorful puzzles to earn rewards and unlock a variety of furniture, decorations, and toys to customize your cat’s room.\n                                                With each level, you’ll discover new challenges and meet new feline friends, each with their own personality. The game combines the satisfaction of matching puzzles with the joy of designing the perfect\n                                                space for your cats to play and relax. Perfect for animal lovers and puzzle enthusiasts alike, Cat Room Blast offers endless fun and creativity!\n                                            ",
        "path": "scraping/GNHUST/games_data/cat-room-blast-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/catroomblast.avif",
        "data_players": "2k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "drift-boss-unblocked",
        "title": "Drift Boss Unblocked",
        "category": "Skill",
        "subcategory": "Endless Runner",
        "instructions": "\n                                                Drift Boss is an exhilarating, fast-paced mobile game that puts your drifting skills to the test. As the name suggests, you take on the role of a masterful drift driver navigating through a series of challenging courses. With its sleek graphics and intuitive\n                                                controls, Drift Boss offers players an immersive experience that keeps them coming back for more. In Drift Boss, players are tasked with maneuvering their car through a variety of winding tracks filled with\n                                                obstacles and tight corners. The objective is simple: drift your way to the finish line while racking up points for style and precision.\n                                            ",
        "path": "scraping/GNHUST/games_data/drift-boss-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/driftboss.jpg",
        "data_players": "26k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "drift-hunters-unblocked",
        "title": "Drift Hunters Unblocked",
        "category": "Skill",
        "subcategory": "Endless_Runner",
        "instructions": "\n                                                Drift Hunters is an exhilarating online drifting game that puts you in the driver's seat of high-performance vehicles, ready to conquer the world of drifting. Customize your car with a wide range of parts, from engines to body kits, to create your ultimate\n                                                drifting machine. Then hit the streets and perfect your drifting technique across various challenging tracks.\n                                            ",
        "path": "scraping/GNHUST/games_data/drift-hunters-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/drifthunter.jpg",
        "data_players": "94k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "polytrack-unblocked",
        "title": "PolyTrack Unblocked",
        "category": "Skill",
        "subcategory": "Endless Runner",
        "instructions": "\n                                                PolyTrack is a fast-paced 3D runner game that tests your reflexes and agility! Race through vibrant, polygonal landscapes, weaving through obstacles and collecting power-ups to boost your score. Each level presents new challenges and stunning environments,\n                                                from neon-lit cityscapes to surreal, abstract worlds. Master your timing, beat your high scores, and compete on the global leaderboard. Perfect for players who crave quick, action-packed gameplay and want\n                                                to push their limits! Can you conquer every track and become the ultimate PolyTrack runner?\n                                            ",
        "path": "scraping/GNHUST/games_data/polytrack-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/polytrack.jpg",
        "data_players": "3k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "rocket-soccer-derby-unblocked",
        "title": "Rocket Soccer Derby Unblocked",
        "category": "Skill",
        "subcategory": "Adventure",
        "instructions": "\n                                                Rocket Soccer Derby is an online multiplayer game that combines elements of soccer with vehicular combat and racing. Players control rocket-powered cars as they compete in soccer matches, attempting to score goals while using various power-ups and maneuvers\n                                                to outmaneuver opponents. The game offers a unique blend of sports and vehicular combat, providing an exciting and fast-paced gameplay experience.\n                                            ",
        "path": "scraping/GNHUST/games_data/rocket-soccer-derby-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/rocketsoccer.png",
        "data_players": "4k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "traffic-jam-3d-unblocked",
        "title": "Traffic Jam 3D Unblocked",
        "category": "Skill",
        "subcategory": "Endless_Runner",
        "instructions": "\n                                                Traffic Jam 3D is a high-speed driving game that challenges you to navigate through busy streets and highways filled with vehicles. Experience realistic traffic scenarios as you dodge cars, weave through tight spaces, and race against the clock to reach\n                                                your destination. With stunning 3D graphics, customizable vehicles, and multiple gameplay modes, Traffic Jam 3D offers endless excitement for driving enthusiasts. Upgrade your car, conquer challenging levels,\n                                                and test your reflexes in this adrenaline-filled game. Whether you're a casual gamer or a speed enthusiast, Traffic Jam 3D promises hours of thrilling entertainment!\n                                            ",
        "path": "scraping/GNHUST/games_data/traffic-jam-3d-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/trafficjam3d.jpg",
        "data_players": "2k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    },
    {
        "id": "moto-x3m-unblocked",
        "title": "Moto X3M Unblocked",
        "category": "Skill",
        "subcategory": "Platformer",
        "instructions": "\n                                                Moto X3M is an exhilarating motorcycle racing game series known for its fast-paced gameplay, challenging tracks, and stunts. Players take control of a motorcyclist and navigate through various obstacle-filled courses to reach the finish line. No need\n                                                to be fast, precision is the most important, show off your skills in this famous game!\n                                            ",
        "path": "scraping/GNHUST/games_data/moto-x3m-unblocked/",
        "imgpath": "https://gnhustgames.github.io/assets/imageGame/x3mmotor.avif",
        "data_players": "42k players",
        "related": [
            "drive-mad",
            "retro-bowl",
            "bob-the-robber-2"
        ]
    }
]